def create_template(count):
    d = dict()
    for i in range(1, count + 1):
        d[i] = {
            "Q": {
                "text": "", "img": ""
            },
            "Option": {
                "A": {"text": "", "img": ""},
                "B": {"text": "", "img": ""},
                "C": {"text": "", "img": ""},
                "D": {"text": "", "img": ""}
            },
            "isImage": ""
        }

    return d


def year112():
    question = {
        1: {
            'Q': {'text': '吳老師鼓勵學生利用課餘時間組成讀書會，共同研讀文學作品。此種學習方式與內容，屬於下列何種課程？', 'img': ''},
            'Option': {
                'A': {'text': '(A)正式課程', 'img': ''},
                'B': {'text': '(B)懸缺課程', 'img': ''},
                'C': {'text': '(C)空無課程', 'img': ''},
                'D': {'text': '(D)非正式課程', 'img': ''}
            },
            'isImage': ''
        },
        2: {
            'Q': {'text': '運用 CIPP 模式實施課程評鑑，其中有關學校課程目標的適切性，屬於下列何種層面的評鑑？', 'img': ''},
            'Option': {
                'A': {'text': '(A)背景評鑑', 'img': ''},
                'B': {'text': '(B)輸入評鑑', 'img': ''},
                'C': {'text': '(C)過程評鑑', 'img': ''},
                'D': {'text': '(D)成果評鑑', 'img': ''}
            },
            'isImage': ''
        },
        3: {
            'Q': {'text': '沈老師編了一份數學成就測驗，發現班上學生在此測驗的得分，與其在該縣市的學習能力檢測之數學表現，在班級排名大致相當。代表此測驗具有下列何種效度？', 'img': ''},
            'Option': {
                'A': {'text': '(A)表面效度', 'img': ''},
                'B': {'text': '(B)內容效度', 'img': ''},
                'C': {'text': '(C)聚斂效度', 'img': ''},
                'D': {'text': '(D)效標關聯效度', 'img': ''}
            },
            'isImage': ''
        },
        4: {
            'Q': {'text': '下列敘述何者較符合課程實施的相互調適觀？', 'img': ''},
            'Option': {
                'A': {'text': '(A)課程實施前，課程設計人員與教師\n   討論後，再進行課程規劃', 'img': ''},
                'B': {'text': '(B)課程實施時，宜因應學校教育的實\n   際情境，再加以彈性調整', 'img': ''},
                'C': {'text': '(C)課程設計人員給予教師明確的說明\n   ，指導教師如何進行教學', 'img': ''},
                'D': {'text': '(D)為確保課程實施品質，課程設計人\n   員彼此間需相互交換意見', 'img': ''}
            },
            'isImage': ''
        },
        5: {
            'Q': {'text': '有關腦力激盪法(brainstorming)，下列敘述何者錯誤？', 'img': ''},
            'Option': {
                'A': {'text': '(A)其功能在於激發跳出框架的思考', 'img': ''},
                'B': {'text': '(B)發散階段時的討論，意見愈多愈好', 'img': ''},
                'C': {'text': '(C)聚斂階段時的討論，不做評價論斷', 'img': ''},
                'D': {'text': '(D)可運用改編、替代等方法得到不同意見', 'img': ''}
            },
            'isImage': ''
        },
        6: {
            'Q': {'text': '王老師認為「學生的天性是善良的，具有成長的潛能，而理想的課程應該是統整的、適性的。」此觀點較接近下列何種課程設計理念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)人本主義取向\n   (humanistic approach)', 'img': ''},
                'B': {'text': '(B)學術理性主義\n   (academi crationalism)', 'img': ''},
                'C': {'text': '(C)社會重建關聯\n   (social reconstruction\n   -relevance)', 'img': ''},
                'D': {'text': '(D)認知過程發展\n   (the development of\n    cognitive process)', 'img': ''}
            },
            'isImage': ''
        },
        7: {
            'Q': {'text': '下列哪一項評量結果屬於標準參照的概念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)期末考全班第三名', 'img': ''},
                'B': {'text': '(B)通過全民英檢中高級測驗', 'img': ''},
                'C': {'text': '(C)學校模擬考成績 PR 值 90', 'img': ''},
                'D': {'text': '(D)大學學科能力測驗社會科四級分', 'img': ''}
            }, 'isImage': ''},
        8: {
            'Q': {'text': '創客(Maker)的精神是動手、創新與分享，著重創造力、實作能力、問題解決能力的培養。下列何者最接近創客教學的理念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)讓學生運用套裝程式，以3D列印\n   機仿作手機吊飾', 'img': ''},
                'B': {'text': '(B)讓學生根據說明書組裝出模擬電動\n   機原理的機械獸', 'img': ''},
                'C': {'text': '(C)讓學生運用撲克牌和骰子設計出因\n   數倍數玩法的桌遊', 'img': ''},
                'D': {'text': '(D)讓學生依據網路影片提供的指導，\n   縫製布袋戲偶的戲服', 'img': ''}
            },
            'isImage': ''},
        9: {
            'Q': {'text': '李老師任教於原住民族實驗教育學校，她發現藝術課程與學生的生活經驗脫節，因而解構原有的課程，從不同族群的觀點來探討音樂、美術工藝、表演藝術的內涵與問題。此屬於下列何種多元文化課程取向？', 'img': ''},
            'Option': {
                'A': {'text': '(A)附加取向', 'img': ''},
                'B': {'text': '(B)貢獻取向', 'img': ''},
                'C': {'text': '(C)轉化取向', 'img': ''},
                'D': {'text': '(D)社會行動取向', 'img': ''}
            },
            'isImage': ''},
        10: {
            'Q': {'text': '教師進行數學加法進位單元時，以課本的例子引導全班練習，對於一些不瞭解進位概念的學生，教師利用小方塊教具讓學生透過具體操作，以瞭解進位的概念。此做法屬於下列何種性質的差異化教學？', 'img': ''},
            'Option': {
                'A': {'text': '(A)學習內容', 'img': ''},
                'B': {'text': '(B)學習方法', 'img': ''},
                'C': {'text': '(C)學習興趣', 'img': ''},
                'D': {'text': '(D)學習評量', 'img': ''}
            },
            'isImage': ''
        },
        11: {
            'Q': {'text': '趙老師打算在閱讀與寫作課讓學生製作學習檔案，以提升其語文能力與興趣。有關學習檔案的規劃與實施，下列做法何者較不適切？', 'img': ''},
            'Option': {
                'A': {'text': '(A)檔案的內容由教師決定，以利檔案\n   的實施與評分', 'img': ''},
                'B': {'text': '(B)事先對學生與家長等相關人士，溝\n   通檔案的目的與目標', 'img': ''},
                'C': {'text': '(C)安排學生定期自我評量與省思，檢\n   視成果並訂定下一步計畫', 'img': ''},
                'D': {'text': '(D)安排同儕評量活動，讓學生展示個\n   人檔案，彼此觀摩與回饋', 'img': ''}
            },
            'isImage': ''
        },
        12: {
            'Q': {'text': '根據《十二年國民基本教育課程綱要總綱》的實施要點，有關學校課程評鑑的敘述，下列敘述何者較適切？', 'img': ''},
            'Option': {
                'A': {'text': '(A)目的在改善教學', 'img': ''},
                'B': {'text': '(B)用以考核教師的績效', 'img': ''},
                'C': {'text': '(C)應由中央主管機關負責', 'img': ''},
                'D': {'text': '(D)為某一單元結束後的學習評量', 'img': ''}
            }, 'isImage': ''
        },
        13: {
            'Q': {'text': '李老師想要在教學過程中，採取合適的策略來激發學生的內在動機。下列哪些做法較合適？\n甲、提供範例，指導學生模仿學習\n乙、結合學生興趣，提高學習的主動性\n丙、引起認知衝突，引發學生好奇、注意\n丁、提供獎勵，促使學生努力達成學習目標\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)丙丁', 'img': ''}
            }, 'isImage': ''
        },
        14: {
            'Q': {'text': '有關學習評量，下列敘述何者正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)適性評量就是真實評量，強調評量\n   情境的擬真', 'img': ''},
                'B': {'text': '(B)師資生在半年教育實習中進行教學\n   演示，屬於實作評量', 'img': ''},
                'C': {'text': '(C)動態評量是以皮亞傑的認知發展理\n   論作為基礎，重視實際操作', 'img': ''},
                'D': {'text': '(D)教師資格考試力求公正減少誤差，\n   以測得真實能力，屬於真實評量', 'img': ''}
            }, 'isImage': ''},
        15: {
            'Q': {'text': '有關《十二年國民基本教育課程綱要總綱》實施要點，下列敘述何者正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)為尊重教師課程教學的專業自主性\n   ，家長不宜參觀教師授課', 'img': ''},
                'B': {'text': '(B)每位教師每學年應至少公開授課一\n   次，藉此評鑑教師的教學成效', 'img': ''},
                'C': {'text': '(C)對於教師自編教材，應尊重教師專\n   業自主決定，無須送交學校審查', 'img': ''},
                'D': {'text': '(D)學校課程計畫應陳報主管機關備查\n   ，並以書面或網站向學生與家長說明', 'img': ''}
            }, 'isImage': ''},
        16: {
            'Q': {'text': '東台國小期末考試數學試題的分析結果中，第五題的鑑別度(D)為.09，難度(P)為.51。有關該分析結果的解釋，下列敘述何者最適切？', 'img': ''},
            'Option': {
                'A': {'text': '(A)大部分的學生都答錯這一題', 'img': ''},
                'B': {'text': '(B)低分組的學生幾乎都答錯了', 'img': ''},
                'C': {'text': '(C)多數高分組的學生答對此題', 'img': ''},
                'D': {'text': '(D)鑑別度太低應重新檢討原因', 'img': ''}
            }, 'isImage': ''},
        17: {
            'Q': {'text': '有關問題導向學習(problem-basedlearning,PBL)，下列敘述何者較不正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)屬於高層次思考的教學模式', 'img': ''},
                'B': {'text': '(B)整合學科知識與真實性經驗', 'img': ''},
                'C': {'text': '(C)教師須選擇結構良好的問題', 'img': ''},
                'D': {'text': '(D)促進學生主動學習與知識建構', 'img': ''}
            }, 'isImage': ''},
        18: {
            'Q': {'text': '陳老師在閱讀社會領域課程綱要後，依據學習重點以「認識家鄉」為單元主題，設計「學生蒐集家鄉的資料並上台報告與回饋」的活動。上課時，陳老師覺得學生蒐集資料及上台報告耗費太多時間，只好減少回饋時間。從古德拉(J.Goodlad)提出的課程層次中，陳老師面臨哪兩種不同課程層次的差距？', 'img': ''},
            'Option': {
                'A': {'text': '(A)運作課程與經驗課程', 'img': ''},
                'B': {'text': '(B)知覺課程與運作課程', 'img': ''},
                'C': {'text': '(C)理念課程與正式課程', 'img': ''},
                'D': {'text': '(D)正式課程與經驗課程', 'img': ''}
            }, 'isImage': ''},
        19: {
            'Q': {'text': '王老師進行提問教學時，為促進學生的聆聽與思考，在回應學生的答案時，下列哪些較為適當？\n甲、你真是太聰明、太棒了！\n乙、有誰也贊成小玉的答案呢？\n丙、這答案不太好，換班長來回答。\n丁、你的說法和家瑄的意思有何異同？\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲丙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)乙丁', 'img': ''}
            }, 'isImage': ''},
        20: {
            'Q': {'text': '咚咚國小教師進行備課時，發現許多領域都有與「自我認識」相關的單元，因此教師們決定調整單元順序，讓各領域中有關「自我認識」的單元都在相近的時間進行教學。此課程規劃屬於下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)相關課程', 'img': ''},
                'B': {'text': '(B)廣域課程', 'img': ''},
                'C': {'text': '(C)融合課程', 'img': ''},
                'D': {'text': '(D)超學科課程', 'img': ''}
            },
            'isImage': ''},
        21: {
            'Q': {'text': '下列哪一項敘述較符合「課程即研究假設」的理念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)強調課程學者於課程設計的角色', 'img': ''},
                'B': {'text': '(B)主張課程內容應以學生經驗為本', 'img': ''},
                'C': {'text': '(C)課程內容應重視恆久的價值與知識', 'img': ''},
                'D': {'text': '(D)重視現場教師的課程專業判斷與省思', 'img': ''}
            }, 'isImage': ''},
        22: {
            'Q': {'text': '有關認知師徒制，下列敘述何者較不適切？', 'img': ''},
            'Option': {
                'A': {'text': '(A)屬於建構取向的教學法', 'img': ''},
                'B': {'text': '(B)經由實作幫助學習者發展問題解決\n   能力', 'img': ''},
                'C': {'text': '(C)由教學者帶領學習者，直接指導操\n   作步驟', 'img': ''},
                'D': {'text': '(D)教學者依學習者學習狀況適時給予\n   指導、示範與回饋', 'img': ''}
            }, 'isImage': ''},
        23: {
            'Q': {'text': '關於各層級課程發展，下列敘述何者較不適切？', 'img': ''},
            'Option': {
                'A': {'text': '(A)教室層級課程發展，可一併考量校\n   園環境或戶外學習的情境', 'img': ''},
                'B': {'text': '(B)國家層級課程發展，除了擬定課程\n   綱要，需一併編寫教科用書', 'img': ''},
                'C': {'text': '(C)學校層級課程發展，除了規劃校訂\n   課程外，可一併考量部定課程的相關\n   性', 'img': ''},
                'D': {'text': '(D)地方政府發展符合地方特色與需求\n   的課程方案時，需一併規劃資源、\n   人力和經費', 'img': ''}
            }, 'isImage': ''},
        24: {
            'Q': {'text': '張老師欲設計「認識兒童權利公約」的探究教學，下列哪些活動設計較適切？\n甲、播放戰爭新聞，引導學生提問並討論「兒童最佳利益」的概念\n乙、讓學生朗讀《兒童權利公約》中有關「兒童生存權」之相關內容\n丙、讓學生閱讀《兒童權利公約》後，指出「禁止歧視」的相關條文\n丁、就學校運動場的設計，從「表意權」引導學生蒐集分析資料，提出建議\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)丙丁', 'img': ''}
            }, 'isImage': ''},
        25: {
            'Q': {'text': '郭老師以探討網路不實訊息的主題進行教學設計，師生共同決定拍攝短片教導民眾分辨不實訊息，並整理不實訊息的資料製作專刊，最後以展演的方式呈現學習成果。此種做法屬於下列何種評量方式？', 'img': ''},
            'Option': {
                'A': {'text': '(A)實作評量', 'img': ''},
                'B': {'text': '(B)動態評量', 'img': ''},
                'C': {'text': '(C)適性評量', 'img': ''},
                'D': {'text': '(D)紙筆測驗', 'img': ''}
            },
            'isImage': ''}
    }


def year111():
    pass


def year110():
    pass


def year109():
    pass


def year108_2():
    pass


def year108_1():
    pass


def year106():
    pass


def year105():
    pass


def year104():
    pass


def year103():
    pass


def year102():
    pass


def year101():
    pass


def year100():
    pass


def year99():
    pass


def year98():
    pass


def year97():
    pass


def year96():
    pass


def year95():
    pass


def year94():
    pass


print(create_template(25))

YEARS = [
    year112(), year111(), year110(), year109(), year108_2(),
    year108_1(), year106(), year105(), year104(), year103(),
    year102(), year101(), year100(), year99(), year98(),
    year97(), year96(), year95(), year94()
]
