def create_template(count):
    d = dict()
    for i in range(1, count + 1):
        d[i] = {
            "Q": {
                "text": "", "img": ""
            },
            "Option": {
                "A": {"text": "", "img": ""},
                "B": {"text": "", "img": ""},
                "C": {"text": "", "img": ""},
                "D": {"text": "", "img": ""}
            },
            "isImage": ""
        }

    return d


def year112():
    question = {
        1: {
            'Q': {'text': '下列大腦區域何者與情緒控制較有關係？', 'img': ''},
            'Option': {
                'A': {'text': '(A)額葉', 'img': ''},
                'B': {'text': '(B)頂葉', 'img': ''},
                'C': {'text': '(C)枕葉', 'img': ''},
                'D': {'text': '(D)顳葉', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '下列何者是指「透過各種社會互動經驗，人們逐漸形成一組對自己優點、缺點、能力、態度、與價值等的整體性知覺」？', 'img': ''},
            'Option': {
                'A': {'text': '(A)自我概念 (self-concept)', 'img': ''},
                'B': {'text': '(B)自我效能 (self-efficacy)', 'img': ''},
                'C': {'text': '(C)自我監控 (self-monitoring)', 'img': ''},
                'D': {'text': '(D)自我管理 (self-management)', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '二年級的小華被診斷為「注意力缺陷過動症」(ADHD) 的「注意力不集中型」(inattention)。根據診斷，下列何者較不可能是小華會出現的臨床症狀？', 'img': ''},
            'Option': {
                'A': {'text': '(A)經常無法仔細注意細節', 'img': ''},
                'B': {'text': '(B)在日常生活中常忘東忘西', 'img': ''},
                'C': {'text': '(C)經常無法遵循指示完成功課', 'img': ''},
                'D': {'text': '(D)經常在問題還沒說完時衝口說出答案', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '老師在教「長度」概念時，要學生在三分鐘內想出十種測量長度的方法，小雄想到的比其他人多。小雄在創造力的哪一個層面表現突出？', 'img': ''},
            'Option': {
                'A': {'text': '(A)流暢力', 'img': ''},
                'B': {'text': '(B)獨創力', 'img': ''},
                'C': {'text': '(C)精進力', 'img': ''},
                'D': {'text': '(D)變通力', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {'text': '小慧全家從北部搬到南部，因而轉學到新學校。他很快就熟悉學校周遭的環境，能跟老師及同學有不錯的互動，也能掌握導師的期許和班規。依據史坦伯格 (R.Sternberg)的智力三元論，大智展現了哪一種智力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)情境智力\n   (contextual intelligence)', 'img': ''},
                'B': {'text': '(B)經驗智力\n   (experiential intelligence)', 'img': ''},
                'C': {'text': '(C)社交智力\n   (interpersonal intelligence)', 'img': ''},
                'D': {'text': '(D)組合智力\n   (componential intelligence)', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {'text': '下列哪些是個人中心學派治療關係的要件？\n甲、同情心\n乙、真誠一致\n丙、積極鼓勵\n丁、無條件積極關注', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)乙丁', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '下列何者不是小團體初期階段的重要目標？', 'img': ''},
            'Option': {
                'A': {'text': '(A)確立成員須共同遵守的規範', 'img': ''},
                'B': {'text': '(B)協助成員感到自己是團體的一份子', 'img': ''},
                'C': {'text': '(C)協助成員深入了解、掌握與發展自我', 'img': ''},
                'D': {'text': '(D)幫助成員建立自己參與團隊的個人目\n   標', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {'text': '學生跟老師說：「每次分組，小豪都拒絕跟我同組，他是不是在排擠我？｣下列老師的回答，何者是較具有同理心的回應？', 'img': ''},
            'Option': {
                'A': {'text': '(A)「是他自己有問題，你不要理他。｣', 'img': ''},
                'B': {'text': '(B)「你很難過，覺得自己不被接納。｣', 'img': ''},
                'C': {'text': '(C)「別這麼說，事情應該不是這樣。｣', 'img': ''},
                'D': {'text': '(D)「你這樣想，對你一點好處都沒有。｣', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {'text': '下列哪一個學派主張將諮商的目標放在具體的問題行為上，以可觀察、可測量的行為來敘述諮商的目標，且特別強調提出具體、明確的解決步驟？', 'img': ''},
            'Option': {
                'A': {'text': '(A)心理分析學派', 'img': ''},
                'B': {'text': '(B)認知治療學派', 'img': ''},
                'C': {'text': '(C)行為治療學派', 'img': ''},
                'D': {'text': '(D)個人中心學派', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {'text': '小英這次閱讀測驗考了 65 分，遠低於全班的平均成績，所以林老師讓他放學後留下接受課後輔導。老師使用交互教學法 (reciprocal teaching) 教小英摘要與提問等閱讀策略，並逐漸將責任轉移給小英。小英在一週後重寫相同測驗的複本，得到了85分。根據以上的情境，下列敘述何者錯誤？', 'img': ''},
            'Option': {
                'A': {'text': '(A)老師的作法符合維高思基\n   (L.Vygotsky)的社會文化論', 'img': ''},
                'B': {'text': '(B)老師提供的鷹架(scaffolding)有助於\n   提升小英的閱讀表現', 'img': ''},
                'C': {'text': '(C)85分代表小英的近側發展區\n   (zoneofproximal development,ZPD)', 'img': ''},
                'D': {'text': '(D)65分可視為小英近側發展區\n   (zoneofproximal development,ZPD)\n   的下限', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {'text': '老師給小元看兩個盒子，一個盒子有泡芙圖案，另一個則有糖果圖案。老師在小元面前把泡芙放入糖果圖案的盒子。這時，老師問小元：「等一下小華進來後，會到哪個盒子找泡芙吃？」老師主要想測試小元的哪一種能力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)自我調節 (self-regulating)', 'img': ''},
                'B': {'text': '(B)道德推理 (moral reasoning)', 'img': ''},
                'C': {'text': '(C)語言組成 (language making)', 'img': ''},
                'D': {'text': '(D)觀點取替 (perspective taking)', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '下列敘述何者不符合柯柏格 (L.Kohlberg) 道德發展階段論的觀點？', 'img': ''},
            'Option': {
                'A': {'text': '(A)發展階段的前後順序會因不同文化而\n   異', 'img': ''},
                'B': {'text': '(B)道德發展可依俗例(convention)分為\n   三期(levels)', 'img': ''},
                'C': {'text': '(C)發展階段所提供的道德思考架構，可\n   應用至各種情境', 'img': ''},
                'D': {'text': '(D)除了第一階段之外，各階段的發展都\n   建立在前一階段的推理之上', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {'text': '教師應依據學生不同的需求與情境來安排座位。下列何種座位安排方式較為不妥？', 'img': ''},
            'Option': {
                'A': {'text': '(A)為增加學生互動機會與提升教學效果\n   ，將桌椅排成ㄇ字型', 'img': ''},
                'B': {'text': '(B)為激勵學生更加精進，按照成績高低\n   依序安排全班的座位', 'img': ''},
                'C': {'text': '(C)運用匿名方式了解學生的人際關係，\n   作為安排座位的參考', 'img': ''},
                'D': {'text': '(D)為維護其他同學的受教權，把嚴重違\n   反紀律的學生暫時安排在教室角落', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {'text': '根據行為學派的理論，老師輔導學生從事學習時，運用哪種增強方式較有效？', 'img': ''},
            'Option': {
                'A': {'text': '(A)當學生進步時，提高增強的頻率', 'img': ''},
                'B': {'text': '(B)整個過程皆應使用立即與持續的增強', 'img': ''},
                'C': {'text': '(C)一開始先持續性增強，之後再間歇性\n   增強', 'img': ''},
                'D': {'text': '(D)一開始先間歇性增強，之後再持續性\n   增強', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {'text': '老師在前兩週的數學課教了最大公因數的概念及算法，小柏做了很多練習才終於學會。這週開始，老師開始教最小公倍數的概念及算法，結果小柏覺得很混淆，原本之前已經學會的最大公因數算法反而不會了。下列心理歷程何者較能解釋前述現象？', 'img': ''},
            'Option': {
                'A': {'text': '(A)順攝抑制\n   (proactive inhibition)', 'img': ''},
                'B': {'text': '(B)順攝助長\n   (proactive facilitation)', 'img': ''},
                'C': {'text': '(C)倒攝抑制\n   (retroactive inhibition)', 'img': ''},
                'D': {'text': '(D)倒攝助長\n   (retroactive facilitation)', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '小志要參加校外教學，前一天晚上就買好隔日的午餐（御飯糰加飲料）放在冰箱內。為了怕忘記帶午餐，特別在門把上夾了一張紙條，上面畫了一個三角形提醒自己。小志使用的是下列哪一項記憶策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)精緻化 (elaboration)', 'img': ''},
                'B': {'text': '(B)意元集組(chunking)', 'img': ''},
                'C': {'text': '(C)選擇性注意(selectiveattention)', 'img': ''},
                'D': {'text': '(D)外在記憶輔助(external memoryaids)', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {'text': '有關特定學習障礙學童的陳述，下列何者正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)學習障礙不會伴隨知覺動作障礙', 'img': ''},
                'B': {'text': '(B)學習障礙不是由智力影響而造成', 'img': ''},
                'C': {'text': '(C)學習障礙主要是由心理社會不利因素\n   所造成', 'img': ''},
                'D': {'text': '(D)學習障礙在臺灣的盛行率介於10%至\n   20%之間', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {'text': '小揚在教室奔跑時不小心把同學的水杯打翻了，以下老師的作法何者符合「邏輯後果」的管教原則？', 'img': ''},
            'Option': {
                'A': {'text': '(A)要求小揚寫班規一遍', 'img': ''},
                'B': {'text': '(B)要求小揚上台唱歌娛樂同學', 'img': ''},
                'C': {'text': '(C)要求小揚反省並檢討自己的錯誤之處', 'img': ''},
                'D': {'text': '(D)要求小揚把地板拖乾並且向同學道歉', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {'text': '小江今年六年級，第一次段考成績不理想，讓他感到失望。小江可以採取下列哪種問題中心因應策略 (problem-centeredcoping)？', 'img': ''},
            'Option': {
                'A': {'text': '(A)透過運動放鬆心情', 'img': ''},
                'B': {'text': '(B)鼓勵自己把握下次的機會', 'img': ''},
                'C': {'text': '(C)向老師或同學請教學習方法', 'img': ''},
                'D': {'text': '(D)告訴自己想開一點，分數不是最重要\n   的事', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {'text': '媽媽在小明面前向他的朋友說：「小明這次段考成績不理想，根本就是不夠用功！」回家後，小明跟媽媽說：「考試成績不理想，並不是我不認真，數學本來就很難。每次你都在你的朋友面前說我表現不好，一點都不考慮我的感受，讓我心裡很不舒服。」小明把成績不理想做何種歸因？', 'img': ''},
            'Option': {
                'A': {'text': '(A)外在而穩定', 'img': ''},
                'B': {'text': '(B)內在而穩定', 'img': ''},
                'C': {'text': '(C)外在而不穩定', 'img': ''},
                'D': {'text': '(D)內在而不穩定', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {'text': '輔導教師協助來談者明確地表達個人的感覺、經驗與行為，聚焦於來談者自己的故事，而非漫無目標的談話。這屬於何種諮商技術？', 'img': ''},
            'Option': {
                'A': {'text': '(A)澄清(clarification)', 'img': ''},
                'B': {'text': '(B)面質(confrontation)', 'img': ''},
                'C': {'text': '(C)摘要(summarization)', 'img': ''},
                'D': {'text': '(D)具體化(concreteness)', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {'text': '小家有高度的數學考試焦慮。李老師試著讓他想像會激起焦慮的考試情境，從引發輕微焦慮的情境直到引發劇烈焦慮的情境。同時引導他面對每一個情境學習放鬆、舒緩壓力，至終解除焦慮。李老師採用的是哪一種治療方法？', 'img': ''},
            'Option': {
                'A': {'text': '(A)現場暴露法', 'img': ''},
                'B': {'text': '(B)系統減敏感法', 'img': ''},
                'C': {'text': '(C)社會技巧訓練', 'img': ''},
                'D': {'text': '(D)自我肯定訓練', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {'text': '高老師班上的國輝時常會與同學發生衝突，若同學不小心碰到他或開他玩笑，他就會攻擊同學或用髒話罵同學。高老師問國輝為何如此，國輝回答：「誰叫他們要故意弄我？」根據以上敘述，國輝的適應問題較可能歸類為下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)學業適應問題', 'img': ''},
                'B': {'text': '(B)內向性行為問題', 'img': ''},
                'C': {'text': '(C)外向性行為問題', 'img': ''},
                'D': {'text': '(D)創傷後壓力症候群', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '七歲的怡君和媽媽及兩歲的妹妹到餐廳吃飯。用完餐後，媽媽離開座位去櫃台結帳，怡君安慰著妹妹說：「媽媽很快就回來了，不要怕，姊姊在這裡陪妳。」下列何者較能說明怡君安慰妹妹的現象？', 'img': ''},
            'Option': {
                'A': {'text': '(A)怡君能夠清楚意識到自己的情緒', 'img': ''},
                'B': {'text': '(B)怡君對於自己的情緒調節掌握得很好', 'img': ''},
                'C': {'text': '(C)怡君非常遵守文化中情緒表達的規則', 'img': ''},
                'D': {'text': '(D)怡君能根據過去經驗預測並理解妹妹\n   的情緒', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {'text': '五年級的小貞和小惠是好朋友，他們常常聊天分享生活點滴。最近小貞的父母發生一些爭吵，小貞和小惠每天談論父母的問題，他們的心情也因此跟著低落下來。此一現象符應下列哪一個概念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)同儕壓力\n   (peerpressure)', 'img': ''},
                'B': {'text': '(B)共同反芻\n   (co-rumination)', 'img': ''},
                'C': {'text': '(C)替代學習\n   (vicarious learning)', 'img': ''},
                'D': {'text': '(D)負增強陷阱\n   (negativereinforcement trap)', 'img': ''}
            },
            "isImage": ""
        }
    }

    return question


def year111():
    question = {
        1: {
            'Q': {'text': '依據艾瑞克森(E. Erikson)的心理社會發展理論，下列何者是學齡期兒童發展的核心議題？', 'img': ''},
            'Option': {
                'A': {'text': '(A)勤奮對自卑\n   (industry vs. inferiority)', 'img': ''},
                'B': {'text': '(B)自動自發對內疚\n   (initiative vs. guilt)', 'img': ''},
                'C': {'text': '(C)自主對羞愧懷疑\n   (autonomy vs. shame and doubt)', 'img': ''},
                'D': {'text': '(D)自我認同對角色混淆\n   (identity vs. role confusion)', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '小光常有上課不專心、容易衝動發言、做事缺乏計畫性等行為表現。他最有可能是哪一腦區的功能有所缺損？', 'img': ''},
            'Option': {
                'A': {'text': '(A)胼胝體', 'img': ''},
                'B': {'text': '(B)邊緣系統', 'img': ''},
                'C': {'text': '(C)顳葉皮質區', 'img': ''},
                'D': {'text': '(D)前額葉皮質區', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '下列哪一種方法不適合用於評量學齡兒童的口語敘事能力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)背誦詩詞', 'img': ''},
                'B': {'text': '(B)自述經驗', 'img': ''},
                'C': {'text': '(C)自我介紹', 'img': ''},
                'D': {'text': '(D)看圖說故事', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '下列敘述何者不屬於網路成癮的核心徵兆？', 'img': ''},
            'Option': {
                'A': {'text': '(A)上網時間越來越長', 'img': ''},
                'B': {'text': '(B)無法克制上網的衝動', 'img': ''},
                'C': {'text': '(C)不喜歡網路人際互動', 'img': ''},
                'D': {'text': '(D)不能上網時出現身心症狀', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {
                'text': '根據現行《學生輔導法》的規範，下列何者不是發展性輔導的工作內容？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)生活輔導', 'img': ''},
                'B': {'text': '(B)學習輔導', 'img': ''},
                'C': {'text': '(C)家庭輔導', 'img': ''},
                'D': {'text': '(D)生涯輔導', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {'text': '當家長向教師抱怨功課太多時，教師以下列何種方式處理較為適當？', 'img': ''},
            'Option': {
                'A': {'text': '(A)努力說服家長，強調自己功課出得多\n   ，是為了學生成績著想', 'img': ''},
                'B': {'text': '(B)了解原因並說明用意，待了解其他學\n   生狀況後，再評估調整', 'img': ''},
                'C': {'text': '(C)利用家長日，讓全班家長充分討論，\n   再表決是否減少功課量', 'img': ''},
                'D': {'text': '(D)因為家長已反映意見，擔心其向校方\n   申訴，最好減少功課量', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '胖虎經常在班上辱罵、欺負大雄，使得大雄害怕上學。下列處理方式何者較不正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)校方可以不受請假相關規定之限制\n   ，彈性處理大雄之出缺勤紀錄', 'img': ''},
                'B': {'text': '(B)為了給予雙方當事人陳述意見之機\n   會，應盡可能讓大雄與胖虎對質', 'img': ''},
                'C': {'text': '(C)校方得知疑似霸凌事件，應於三工\n   作日內召開防制校園霸凌因應小組\n   會議', 'img': ''},
                'D': {'text': '(D)校方在不知情的情況下，如果大雄\n   以匿名書面申請調查，學校得不受\n   理', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {'text': '育之把自己的座位弄得髒亂不堪，老師除了請他把座位清理乾淨，還要求他把教室打掃一遍。這是下列何種機制的應用？', 'img': ''},
            'Option': {
                'A': {'text': '(A)負增強', 'img': ''},
                'B': {'text': '(B)饜足法', 'img': ''},
                'C': {'text': '(C)反應代價', 'img': ''},
                'D': {'text': '(D)過度矯正', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {'text': '哲琦對輔導老師說：「我爸是老師，爸媽離婚後，爸爸再婚。新媽媽不喜歡別人知道我是爸爸的孩子，不准我在別人面前喊『爸爸』，要叫爸爸『老師』。很多時候我都去祖父母家住。」下列輔導老師的回應，哪一項較符合「初層次同理心」？', 'img': ''},
            'Option': {
                'A': {'text': '(A)你是否曾有逃家的念頭？', 'img': ''},
                'B': {'text': '(B)有祖父母疼惜你，多好！像我都沒\n   有，真羨慕你。', 'img': ''},
                'C': {'text': '(C)你覺得很難過，因為新媽媽不希望\n   別人知道你跟爸爸的關係。', 'img': ''},
                'D': {'text': '(D)新媽媽有自卑心理，無法面對自己\n   的選擇，你應該要同理她。', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {
                'text': '期中考快到了，爸爸和小新討論出一些方法來幫助他學習，下列何者不屬於後設認知策略？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)檢討學習方法是否有效', 'img': ''},
                'B': {'text': '(B)檢討考題，調整複習方式', 'img': ''},
                'C': {'text': '(C)整理歸納老師上課的重點', 'img': ''},
                'D': {'text': '(D)針對各科性質規劃讀書時間與策略 ', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {
                'text': '學生進行整數的乘除運算，完成「每邊長 60 公分的正方形瓷磚，每塊售價 14.4 元，若要以此瓷磚鋪滿一間長 3.6 公尺、寬 2.7 公尺的長方形房間，需要花多少錢？解這道題目時要用到「乘、除法的運算」，此種運算屬於哪一類知識？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)惰性知識\n   (inertial knowledge)', 'img': ''},
                'B': {'text': '(B)程序性知識\n   (procedural knowledge)', 'img': ''},
                'C': {'text': '(C)陳述性知識\n   (declarative knowledge)', 'img': ''},
                'D': {'text': '(D)條件性知識\n   (conditional knowledge)', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '蘇老師教英文時，經常使用具有諧音的中文字來幫助學生記憶英文單字。例如，先告訴學生「bounce」的諧音是「棒死」，再告訴學生「球會『彈起來』，真是『棒死了』！」這是哪一種記憶策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)位置法', 'img': ''},
                'B': {'text': '(B)串節法', 'img': ''},
                'C': {'text': '(C)假借字法', 'img': ''},
                'D': {'text': '(D)關鍵字法', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {'text': '新聞報導一名柬埔寨小男童能用多國語言向遊客兜售紀念品。小男童的行為表現較 符合史坦伯格(R. Sternberg)智力三元論的哪一種智能類型？', 'img': ''},
            'Option': {
                'A': {'text': '(A)實用智能\n   (practical intelligence)', 'img': ''},
                'B': {'text': '(B)創造智能\n   (creative intelligence)', 'img': ''},
                'C': {'text': '(C)分析智能\n   (analytical intelligence)', 'img': ''},
                'D': {'text': '(D)經驗智能\n   (experiential intelligence)', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {'text': '關於「鼓勵」(encourage)與「讚賞」(praise)的運用，下列何者正確？\n甲、鼓勵通常只能用在兒童表現不佳的時候\n乙、讚賞是一種隨時隨地可以運用的方法\n丙、鼓勵著重兒童努力的過程而不論其表現\n丁、讚賞是一種有條件式接納兒童的作為\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)丙丁', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {
                'text': '皮亞傑(J. Piaget)與維高思基(L. S. Vygotsky)對於兒童「自言自語」的行為，提出了不同的觀點，下列敘述何者錯誤？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)皮亞傑認為這是兒童自我中心的一\n   種表現', 'img': ''},
                'B': {'text': '(B)維高思基認為內在對話能力是高層\n   次認知歷程的發展特徵', 'img': ''},
                'C': {'text': '(C)皮亞傑認為兒童自言自語的行為反\n   映兒童認知發展尚未成熟', 'img': ''},
                'D': {'text': '(D)維高思基認為當工作變得比較難時\n   ，兒童自言自語的表現會減少', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '課堂活動的銜接或轉換(transition)如果沒有妥善控制，可能會浪費時間，並容易出現 學生失序的行為。下列哪一種作法較難順暢地進行課堂活動轉換？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)給予學生語文提示，要求學生重述\n   後再轉換', 'img': ''},
                'B': {'text': '(B)建立課堂活動慣例，讓學生熟悉活\n   動轉換流程', 'img': ''},
                'C': {'text': '(C)控制轉換時間，在活動時間結束時\n   就立刻轉換', 'img': ''},
                'D': {'text': '(D)以非語文信號集中學生注意力，說\n   明活動轉換流程', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {'text': '下列哪一個敘述較符合能力實存觀(entity view of ability)的概念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)小玲在接受體操訓練時總是滿頭大\n   汗，覺得自己的實力越來越強', 'img': ''},
                'B': {'text': '(B)小平看到發回來的考卷，說：\n   「我怎麼那麼笨，被題目給騙了。」', 'img': ''},
                'C': {'text': '(C)小威：「我的記憶力遺傳到我爸，\n   要考好英文對我而言是困難的。」', 'img': ''},
                'D': {'text': '(D)小安雖未獲選為籃球校隊，但他仍\n   每天針對弱點苦練，積極準備明年\n   的校隊甄選', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {'text': '李老師想要以滿足學生「自主需求」(need of autonomy)來提升學習動機。下列哪些作法較適合李老師採用？甲、提供學生選擇的機會\n乙、訂定明確的班級規範\n丙、讓學生為自己的學習選擇承擔後果\n丁、強調學業成就對未來生活的重要性\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丙', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)乙丁', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {'text': '小雅希望班上同學都喜歡、讚美她，然而她在班上卻有人際關係的困擾。陳老師試著引導她思考：「在學校裡有沒有一些特別的情況，是妳可以跟同學和諧相處的？那時候妳是怎麼辦到的？」老師採用的是哪一個學派的諮商輔導策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)溝通分析治療學派', 'img': ''},
                'B': {'text': '(B)個人中心治療學派', 'img': ''},
                'C': {'text': '(C)理性情緒治療學派', 'img': ''},
                'D': {'text': '(D)後現代治療學派', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {
                'text': '下列哪位兒童的認知發展最有可能已經進入形式運思期？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)小忠能夠控制變因，找出影響鐘擺\n   速度的因素', 'img': ''},
                'B': {'text': '(B)小美將鉛筆盒中的筆按照長短排列\n   ，並加以分類 ', 'img': ''},
                'C': {'text': '(C)小花能理解毛毛蟲轉變成蛹再轉變\n   成蝴蝶的歷程', 'img': ''},
                'D': {'text': '(D)小明知道液體從 A 杯倒入B杯，\n   體積仍不會改變', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {'text': '小學五年級的小和來自新移民家庭，平常就能夠很自然的使用國語以及越南語溝通。相較於只習慣使用國語溝通的同學，小和在下列哪一項能力的發展較為有利？', 'img': ''},
            'Option': {
                'A': {'text': '(A)執行功能', 'img': ''},
                'B': {'text': '(B)情緒覺察', 'img': ''},
                'C': {'text': '(C)圖形辨識', 'img': ''},
                'D': {'text': '(D)知覺廣度', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {
                'text': '教師資格考試結束後，幾位考生收到成績時分別有下列的反應：\n志明說：「今年題目特別難，我才會不及格。」\n春嬌說：「考試當天我身體不舒服，才會考這麼差！」\n國強說：「我用紫微斗數算過，知道自己今年考運很讚！」\n芳瑜說：「我本來就真的很不會考試啊！」\n根據溫納(B. Weiner)的歸因理論，下列何者正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)志明使用外在、可控制的歸因', 'img': ''},
                'B': {'text': '(B)春嬌使用內在、不穩定的歸因 ', 'img': ''},
                'C': {'text': '(C)國強使用外在、穩定的歸因 ', 'img': ''},
                'D': {'text': '(D)芳瑜使用內在、可控制的歸因', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {
                'text': '張老師向全班說明接下來的時間要同學各自做習作練習題，他注意到小方傳一張便利貼給小潔。張老師一邊繼續說明一邊走向小潔，不動聲色地拿走便利貼。此屬於下列    何種班級經營技巧的應用？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)全面掌控\n   (withitness)', 'img': ''},
                'B': {'text': '(B)團體聚焦\n   (group focus)', 'img': ''},
                'C': {'text': '(C)同時進行多項活動\n   (overlapping)', 'img': ''},
                'D': {'text': '(D)動作管理\n   (movement management)', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '全班同學跑完操場十圈之後，體育老師對著又餓又累急於下課的同學說：「你們什麼時候把體育用品整理好，就什麼時候下課。」老師運用的是下列何種機制？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)消弱', 'img': ''},
                'B': {'text': '(B)負增強', 'img': ''},
                'C': {'text': '(C)剝奪式懲罰', 'img': ''},
                'D': {'text': '(D)施予式懲罰', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {'text': '陳老師是國小一年級的導師。有一天，班上小朋友非常吵鬧，陳老師很生氣地說：「你們的聲音快把屋頂掀掉了！」小朋友看著屋頂滿臉疑惑的說：「屋頂好好的啊！」針對小朋友的反應，下列解釋何者較為正確？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)學生對陳老師這麼說很不高興，所以\n   故意說那些話氣陳老師', 'img': ''},
                'B': {'text': '(B)這班學生可能在語言上有發展遲緩的\n   現象，才會聽不懂陳老師的話', 'img': ''},
                'C': {'text': '(C)當時班上實在太吵了，學生沒有注意\n   陳老師說什麼，所以聽不懂老師的話', 'img': ''},
                'D': {'text': '(D)理解比喻和反諷語的發展年齡較晚，\n   小一學生聽不懂陳老師的話是正常的', 'img': ''}
            },
            "isImage": ""
        }
    }

    return question


def year110():
    question = {
        1: {
            'Q': {'text': '依據史坦柏格(R. Sternberg)的智力三元理論，「學業成績」通常反映下列何種智力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)人際智力\n   (interpersonal intelligence)', 'img': ''},
                'B': {'text': '(B)創造智力\n   (creative intelligence) ', 'img': ''},
                'C': {'text': '(C)實用智力\n   (practical intelligence)', 'img': ''},
                'D': {'text': '(D)分析智力\n   (analytical intelligence) ', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '班上來了一位新同學，為了記住這個人的名字，你在心裡反覆唸了幾次他的名字。\n這個過程最有可能發生在訊息處理的哪一個階段？', 'img': ''},
            'Option': {
                'A': {'text': '(A)感官記憶', 'img': ''},
                'B': {'text': '(B)工作記憶', 'img': ''},
                'C': {'text': '(C)長期記憶', 'img': ''},
                'D': {'text': '(D)情節記憶', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '導師辦理母親節的「感恩媽媽」班級輔導活動，此屬於三級輔導中的哪一個層級？', 'img': ''},
            'Option': {
                'A': {'text': '(A)發展性輔導', 'img': ''},
                'B': {'text': '(B)處遇性輔導', 'img': ''},
                'C': {'text': '(C)介入性輔導', 'img': ''},
                'D': {'text': '(D)危機性輔導', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '小宏是閱讀障礙兒童，下列何者不是小宏應該會有的表現？', 'img': ''},
            'Option': {
                'A': {'text': '(A)魏氏兒童智力量表總智商低\n   於70', 'img': ''},
                'B': {'text': '(B)在獨自閱讀兒童讀物時有明\n   顯困難', 'img': ''},
                'C': {'text': '(C)讀課文的速度明顯較其他同\n   班同學慢', 'img': ''},
                'D': {'text': '(D)注音符號的認讀學習明顯落\n   後同班同學', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {
                'text': '大雄平日喜歡看拳擊、摔角之類的節目，也喜歡玩格鬥、虐殺的電玩遊戲。看到有人虐待動物或欺負無辜者，沒有不安的情緒，覺得沒什麼。下列哪一種概念最能解釋大雄的情況？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)社會刻板印象\n   (social stereotype)', 'img': ''},
                'B': {'text': '(B)社會調節偏誤\n   (social adjustment bias) ', 'img': ''},
                'C': {'text': '(C)減敏感作用\n   (desensitization) ', 'img': ''},
                'D': {'text': '(D)媒體素養缺乏\n   (media literacy\n    deficiency)', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {'text': '下列何種班級情境佈置對學生的學習最有助益？', 'img': ''},
            'Option': {
                'A': {'text': '(A)定期更換節慶活動圖片或照\n   片，以營造歡樂氛圍', 'img': ''},
                'B': {'text': '(B)大量張貼優秀學生的學習單\n   或作品，以展現教學成效', 'img': ''},
                'C': {'text': '(C)配合課程張貼每位學生的學\n   習作業，以收相互學習之效', 'img': ''},
                'D': {'text': '(D)張貼各式各樣標語或行為準\n   則，以規訓學童不良舉措或\n   品行 ', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '小華分不出「ㄥ」和「ㄣ」的差別，請問小華缺乏何種能力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)辨識文字', 'img': ''},
                'B': {'text': '(B)語意理解', 'img': ''},
                'C': {'text': '(C)語言理解', 'img': ''},
                'D': {'text': '(D)聲韻覺識', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {'text': '謝老師想協助學生發展「監控自己閱讀理解」的技巧，謝老師最適合採用下列哪些做法？\n甲、把學生的默讀活動改為大聲朗讀\n乙、教師先解說閱讀材料的內容再讓學生練習閱讀\n丙、讓學生在閱讀時停下來問自己有關閱讀內容的問題\n丁、讓學生閱讀一段後自己解釋所理解的內容\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)乙丙', 'img': ''},
                'C': {'text': '(C)丙丁', 'img': ''},
                'D': {'text': '(D)甲丁', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {
                'text': '小新的大腦海馬迴受損，他最可能出現下列哪一種問題？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)無法控制情緒常發脾氣', 'img': ''},
                'B': {'text': '(B)身體動作不協調時常跌倒', 'img': ''},
                'C': {'text': '(C)無法判斷對話中的弦外之音', 'img': ''},
                'D': {'text': '(D)記不住老師課堂的教學內容', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {
                'text': '已升上小學六年級的小英跟導師說：「我已經要上國中了，可是爸媽老是把我當小孩子看，什麼事都問得很仔細，好像我都不懂一樣。好煩喔，我很想要自己試試看！」下列哪一個句子最接近導師展現同理心的回應？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)「你是不是做過什麼事讓他們\n   不放心呢？」', 'img': ''},
                'B': {'text': '(B)「你覺得很煩，希望父母可以\n   支持你獨立。」', 'img': ''},
                'C': {'text': '(C)「你應該極力去爭取你的自由\n   ，不要輕易放棄。」', 'img': ''},
                'D': {'text': '(D)「這就是天下父母心，總是愛\n   自己的孩子，你要好好\n   珍惜。」', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {
                'text': '下列哪些做法較可能提升班級的合作氣氛？\n甲、詳列學習班規，以規範不願意參與合作學習的學生\n乙、建立班級共同的目標，促使學生為共同目標而努力\n丙、如果學生表現關心班級事務，立即給予獎賞和鼓勵\n丁、鼓勵高、低成就的學生個別學習，以進行適性輔導',
                'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)丙丁', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '下列何者符合兒童進入小學後，自尊評估(estimated self-esteem)的改變？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)從高估自尊降低至符合現實\n   水準的評估', 'img': ''},
                'B': {'text': '(B)從低估自尊提升至符合現實\n   水準的評估', 'img': ''},
                'C': {'text': '(C)從原有符合現實自尊水準評\n   估轉為低估', 'img': ''},
                'D': {'text': '(D)從原有符合現實自尊水準評\n   估轉為高估', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {'text': '下列哪一種情況最能說明羅吉斯(C. Rogers)「無條件的正向關懷和接納」？', 'img': ''},
            'Option': {
                'A': {'text': '(A)只要小萱表現良好，父母都\n   會特別讚賞，並立即給予肯\n   定的話語或獎品', 'img': ''},
                'B': {'text': '(B)小萱把咖哩倒在客廳的新地\n   毯上，父母不但沒有表現出\n   生氣，還說她做得很好', 'img': ''},
                'C': {'text': '(C)小萱和妹妹打架，弄傷了妹\n   妹。爸媽告訴小萱雖然她做\n   錯事，但仍然是他們的寶貝\n   孩子', 'img': ''},
                'D': {'text': '(D)小萱在學校不小心弄壞同學\n   的貴重樂器。媽媽告訴小萱\n   ，只要以後不要再發生這種\n   事，就還是媽媽的好孩子 ', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {
                'text': '依據柯柏格(L. Kohlberg)的道德認知發展論點，以下排列順序，何者正確？\n'
                        '甲、老師希望我們做一個善良的人，所以我會對每個人都很友善\n'
                        '乙、就算我認為班規不是很合理，但我也會乖乖遵守\n'
                        '丙、如果別人對我好，我就會對他好\n'
                        '丁、是非善惡的評斷標準，取決的是個人的良心\n',
                'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙丙丁', 'img': ''},
                'B': {'text': '(B)丙甲乙丁', 'img': ''},
                'C': {'text': '(C)丙甲丁乙', 'img': ''},
                'D': {'text': '(D)甲丙乙丁', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {
                'text': '張老師發現用連續正增強的方式鼓勵曉方準時繳交家庭作業很有效，為了讓她轉化為自發性按時交作業，張老師應該採用下列何種方式？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)改用負增強', 'img': ''},
                'B': {'text': '(B)立即停止增強', 'img': ''},
                'C': {'text': '(C)增加正增強頻率', 'img': ''},
                'D': {'text': '(D)改用間歇式增強', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '陳老師在黑板上畫了一個圖形，他要學生以這個圖形為基礎，畫出其他的圖，越多越好。陳老師想要培養學生何種類型的認知能力？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)批判性思考', 'img': ''},
                'B': {'text': '(B)頓悟性思考', 'img': ''},
                'C': {'text': '(C)聚斂性思考', 'img': ''},
                'D': {'text': '(D)擴散性思考', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {'text': '「小明為了要搶妹妹的玩具，把妹妹打哭了」。這種攻擊行為是屬於下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)工具性攻擊', 'img': ''},
                'B': {'text': '(B)敵意性攻擊', 'img': ''},
                'C': {'text': '(C)報復性攻擊', 'img': ''},
                'D': {'text': '(D)關係性攻擊', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {
                'text': '如果兒童知道小明拿到的耶誕禮物數量多於小華，且小華的禮物數量多於小宣。他就能夠瞭解小明拿的禮物最多。表示他具備下列哪一種概念？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)分類', 'img': ''},
                'B': {'text': '(B)去集中化', 'img': ''},
                'C': {'text': '(C)後設認知', 'img': ''},
                'D': {'text': '(D)遞移推論 ', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {
                'text': '採用低調班級經營(low-profile classroom management)策略來處理學生的不當行為時，老師可以運用的技巧包括：預測(anticipation)、轉向(deflection)、回應(reaction)。當張老師要全班開始做數學習作的練習題時，他注意到曉方沒有翻開習作本，而且臉上出現不耐煩的表情。張老師走近曉方，對她說：「曉方，現在應該要完成第15頁的練習題。」上述情境中，他依序採用了哪些低調班級經營的技巧？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)預測、回應', 'img': ''},
                'B': {'text': '(B)預測、轉向', 'img': ''},
                'C': {'text': '(C)轉向、回應', 'img': ''},
                'D': {'text': '(D)回應、轉向', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {
                'text': '根據薛爾曼(R. Selman)的觀點取替發展理論，小學高年級的兒童可以了解對方想做的事情不同，同時也可以站在對方立場來思考原因，例如：小新可以理解弟弟想去公園玩是因為弟弟已經兩個星期都沒有去了。這敘述符合下列哪一個階段？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)社會群體階段\n   (societal stage)', 'img': ''},
                'B': {'text': '(B)第三人階段\n   (third-person stage)', 'img': ''},
                'C': {'text': '(C)自我反思階段\n   (self-reflective\n    stage)', 'img': ''},
                'D': {'text': '(D)社會訊息階段\n   (social-informational\n    stage)', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {'text': '小明想要跟小華借橡皮擦，小華不想借給小明。下列哪一項較符合自我肯定(self-assertiveness)的回應？', 'img': ''},
            'Option': {
                'A': {'text': '(A)「老師不是說每個人都要帶橡\n   皮擦嗎？」', 'img': ''},
                'B': {'text': '(B)「橡皮擦我會常用到，不方便\n   借給你。」', 'img': ''},
                'C': {'text': '(C)「別把我的橡皮擦拿走，不然\n   你看著辦！」', 'img': ''},
                'D': {'text': '(D)「好吧，你先把橡皮擦拿去，\n   用完要還給我。」', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {
                'text': '閱讀下文後，回答22-23題。\n'
                        '第一次段考結束後，老師一上課就開始發數學答案卷。在看到分數後，學生的反應如下：\n'
                        '小華說：「要是考試前一天不要去參加你的生日派對，好好認真準備，我一定可以考前三名。」\n'
                        '大維說：「我的努力總算沒有白費，我覺得這次準備考試學習很多，我下次一定要更努力。」\n\n'
                        '根據溫納(B. Weiner)的歸因理論，下列何者正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)小華使用外在、穩定、可控制\n   的歸因', 'img': ''},
                'B': {'text': '(B)小華使用內在、不穩定、可控\n   制的歸因', 'img': ''},
                'C': {'text': '(C)大維使用內在、穩定、不可控\n   制的歸因', 'img': ''},
                'D': {'text': '(D)大維使用外在、不穩定、可控\n   制的歸因', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {
                'text': '根據小華和大維的說法，他們可能抱持不同的目標導向。下列敘述何者較為正確？\n\n'
                        '第一次段考結束後，老師一上課就開始發數學答案卷。在看到分數後，學生的反應如下：\n'
                        '小華說：「要是考試前一天不要去參加你的生日派對，好好認真準備，我一定可以考前三名。」\n'
                        '大維說：「我的努力總算沒有白費，我覺得這次準備考試學習很多，我下次一定要更努力。」\n',
                'img': ''},
            'Option': {
                'A': {'text': '(A)小華抱持迴避表現目標', 'img': ''},
                'B': {'text': '(B)小華抱持迴避精熟目標', 'img': ''},
                'C': {'text': '(C)大維抱持趨向精熟目標', 'img': ''},
                'D': {'text': '(D)大維抱持趨向表現目標', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '閱讀下文後，回答24-25題。\n'
                          '上歷史課時，學生會想辦法記住課本中的許多名詞或年代。李老師讓班上學生藉由閱讀歷史事件的原始資料來思考課本的內容，並問學生兩個問題。\n'
                          '第一個問題是：「從這個歷史事件中你得到什麼啟發？」\n'
                          '第二個問題是：「讀完之後，還有哪些地方是你不太了解的？」\n\n'
                          '上述情境中，學生將重點放在哪一種知識的學習？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)陳述性知識', 'img': ''},
                'B': {'text': '(B)程序性知識', 'img': ''},
                'C': {'text': '(C)條件性知識', 'img': ''},
                'D': {'text': '(D)操作性知識', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {
                'text': '李老師的兩個提問，意圖幫助學生提昇哪一方面的能力？\n\n'
                        '上歷史課時，學生會想辦法記住課本中的許多名詞或年代。李老師讓班上學生藉由閱讀歷史事件的原始資料來思考課本的內容，並問學生兩個問題。\n'
                        '第一個問題是：「從這個歷史事件中你得到什麼啟發？」\n'
                        '第二個問題是：「讀完之後，還有哪些地方是你不太了解的？」\n\n',
                'img': ''},
            'Option': {
                'A': {'text': '(A)自動化\n   (automaticity)', 'img': ''},
                'B': {'text': '(B)意元集組\n   (chunking)', 'img': ''},
                'C': {'text': '(C)後設認知\n   (metacognition)', 'img': ''},
                'D': {'text': '(D)精緻複誦\n   (elaborative rehearsal)', 'img': ''}
            },
            "isImage": ""
        }
    }

    return question


def year109():
    question = {
        1: {
            'Q': {'text': '針對適應欠佳、重複發生問題行為學生的輔導工作，較屬於下列哪個層級的輔導？', 'img': ''},
            'Option': {
                'A': {'text': '(A)發展性輔導', 'img': ''},
                'B': {'text': '(B)介入性輔導', 'img': ''},
                'C': {'text': '(C)處遇性輔導', 'img': ''},
                'D': {'text': '(D)教育性輔導', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '有關學業成績低落個案的輔導，主要有三大步驟，其正確的順序為下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)分析問題原因→了解問題\n   性質→進行輔導矯治', 'img': ''},
                'B': {'text': '(B)了解問題性質→進行輔導\n   矯治→分析問題原因', 'img': ''},
                'C': {'text': '(C)了解問題性質→分析問題\n   原因→進行輔導矯治', 'img': ''},
                'D': {'text': '(D)分析問題原因→進行輔導\n   矯治→了解問題性質', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '小明上課吵鬧不停，老師不准他下課時間到教室外面玩。爾後要求他安靜上課，若小明不再吵鬧就取消他不准出去玩的禁令，此時老師主要是運用下列何種策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)負增強', 'img': ''},
                'B': {'text': '(B)正增強', 'img': ''},
                'C': {'text': '(C)消弱', 'img': ''},
                'D': {'text': '(D)懲罰', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '小昇在學習數學時，會把加法策略應用到結構相似的新問題上。小昇這種能力的改變是屬於訊息處理理論的何種機制？', 'img': ''},
            'Option': {
                'A': {'text': '(A)編碼\n   (encoding)', 'img': ''},
                'B': {'text': '(B)類化\n   (generalization) ', 'img': ''},
                'C': {'text': '(C)自動化\n   (automatization)', 'img': ''},
                'D': {'text': '(D)建構策略\n   (strategy construction) ', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {
                'text': '王老師得知班上的小玲被繼父性侵害，該學校應在幾個小時內進行通報？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)12小時', 'img': ''},
                'B': {'text': '(B)24小時', 'img': ''},
                'C': {'text': '(C)36小時', 'img': ''},
                'D': {'text': '(D)48小時', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {'text': '段考後李老師要求班上的四年級學生對考試結果進行「錯誤原因分析」，將答錯題目的錯誤類型區分為「粗心」、「不會」、「來不及寫」等，然後再根據每一種錯誤類型提出不同的因應方式。李老師的作法最主要是訓練學生的何種能力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)後設認知', 'img': ''},
                'B': {'text': '(B)後設記憶', 'img': ''},
                'C': {'text': '(C)後設溝通', 'img': ''},
                'D': {'text': '(D)後設語言覺察', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '小志在閱讀英文時常會把「pet」看作是「bet」、「dog」當作是「god」，但經專業診斷發現小志智力正常，也沒有身體、情緒或社會方面失調的現象。小志的狀況最可能是屬於下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)自閉症', 'img': ''},
                'B': {'text': '(B)學習遲緩', 'img': ''},
                'C': {'text': '(C)學習障礙', 'img': ''},
                'D': {'text': '(D)注意力缺陷過動症', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {
                'text': '張老師發現，近年來入學新生中學業成就較高的兒童，多半來自於高社經地位家庭，或是父母比較願意投入資源在教育上的家庭。此發現最符合下列何項說明？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)環境的確會影響學業成就', 'img': ''},
                'B': {'text': '(B)基因決定兒童的學業成就表\n   現', 'img': ''},
                'C': {'text': '(C)學業成就和遺傳間的關係不\n   大', 'img': ''},
                'D': {'text': '(D)學業成就和社經地位有高度\n   負相關', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {
                'text': '黃老師發現班上同學的學習各具特色，有人喜歡聽講，有人對視覺圖像理解快速，有人則擅於透過操作來學習。黃老師對這班學生的教學與評量方式，下列何者最不適宜？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)針對學生認知型態調整上\n   課方式', 'img': ''},
                'B': {'text': '(B)以單一時間點作為評量學\n   生學習表現的依據', 'img': ''},
                'C': {'text': '(C)以檔案評量(portfolio assessment)\n   了解學生的學習', 'img': ''},
                'D': {'text': '(D)採用多種不同的教學法(講述\n   、多媒體教學、使用教具)', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {
                'text': '根據班度拉(A. Bandura)的交互決定論(reciprocal determinism)，探討行為必須了解以下哪三者的交互影響？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)個人、行為與環境 ', 'img': ''},
                'B': {'text': '(B)遺傳、文化與行為', 'img': ''},
                'C': {'text': '(C)個人、歷史與行為', 'img': ''},
                'D': {'text': '(D)行為、歷史與環境', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {
                'text': '六年級的小娟這次段考成績不佳，於是努力練習跑步，希望在即將到來的運動會中有優異的成績表現。小娟的這種行為最符合下列何種防衛機轉？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)投射\n   (projection)', 'img': ''},
                'B': {'text': '(B)壓抑\n   (suppression)', 'img': ''},
                'C': {'text': '(C)替代\n   (displacement)', 'img': ''},
                'D': {'text': '(D)合理化\n   (rationalization)', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '學校輔導人員具有保密的義務，然而下列何種狀況最需要對監護人或者第三人進行預警？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)個案有自殺傾向', 'img': ''},
                'B': {'text': '(B)與個案有雙重關係', 'img': ''},
                'C': {'text': '(C)維護個案的受教權', 'img': ''},
                'D': {'text': '(D)個案導師要求閱讀資料', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {'text': '依據兒童語言發展的理論，下列何者不正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)行為主義學派主張語言發展\n   是後天學習，以模仿及增強\n   來說明語言發展的過程', 'img': ''},
                'B': {'text': '(B)杭士基(A. Chomsky)先天\n   論認為兒童有能力將語詞組\n   合，形成一套有系統的語法規\n   則', 'img': ''},
                'C': {'text': '(C)互動論結合先天論與學習論\n   的觀點，主張語言發展由成\n   熟、認知發展與社會互動的\n   環境相互影響', 'img': ''},
                'D': {'text': '(D)認知建構學者認同語言發展\n   與兒童的思考、創造力、問\n   題解決能力相關，強調人類\n   具有「語言習得機制」', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {
                'text': '下列何者是投射測驗的優點？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)較客觀', 'img': ''},
                'B': {'text': '(B)計分方便', 'img': ''},
                'C': {'text': '(C)不易作假', 'img': ''},
                'D': {'text': '(D)較有結構性', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {
                'text': '如果研究者想短時間進行6歲到10歲兒童道德發展的比較，最常使用下列哪一種研究設計？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)橫斷研究設計', 'img': ''},
                'B': {'text': '(B)縱貫研究設計', 'img': ''},
                'C': {'text': '(C)個案研究設計', 'img': ''},
                'D': {'text': '(D)序列研究設計', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '一年級的小偉跟林老師很熟稔，有一天他笑著跟老師說：「老師你很狗屎。」想看看老師會有甚麼反應。林老師針對小偉的行為，最適合的輔導作法為下列何者？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)向全班討論這件事情', 'img': ''},
                'B': {'text': '(B)向小偉的父母說明這件事', 'img': ''},
                'C': {'text': '(C)告訴小偉他的話會讓人不舒\n   服', 'img': ''},
                'D': {'text': '(D)嚴厲的指正小偉不應該說這\n   個難聽的詞彙', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {'text': '小華上學過馬路時發現四下無人也沒有來車，本想直接穿越馬路，但快遲到的他卻仍遵守交通規則，等到綠燈亮起後才拔腿狂奔。以柯柏格(L. Kohlberg)的道德發展理論，小華的道德推理是屬於哪一個階段？', 'img': ''},
            'Option': {
                'A': {'text': '(A)避罰服從取向', 'img': ''},
                'B': {'text': '(B)相對功利取向', 'img': ''},
                'C': {'text': '(C)尋求認可取向', 'img': ''},
                'D': {'text': '(D)維持社會秩序取向', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {
                'text': '在學校輔導實務工作上可發現，兒童的許多問題均與家長或學校導師有關聯，下列哪一個論述最為恰當？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)輔導教師可透過諮詢來收集\n   資訊、澄清問題和促進系統\n   合作', 'img': ''},
                'B': {'text': '(B)輔導教師同步進行導師諮詢\n   和家長諮詢，會失去客觀性\n   而應避免', 'img': ''},
                'C': {'text': '(C)在親職教育中針對家長運用\n   大型演講進行成效有限，故\n   初期不宜實施', 'img': ''},
                'D': {'text': '(D)若轉介者為導師，則輔導教\n   師與家長進行諮詢時，宜傳\n   達導師的重要期待 ', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {
                'text': '有關「低成就學生」的敘述，下列何者不正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)通常男生多於女生', 'img': ''},
                'B': {'text': '(B)輔導策略是利用藥物為主', 'img': ''},
                'C': {'text': '(C)可以分成情境性及長期性低\n   成就兩種類型', 'img': ''},
                'D': {'text': '(D)是指智力與同齡者相似，學\n   習成就顯著低於一般學生', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {
                'text': '小奇是個高攻擊性的學生，教師利用「軼事記錄」來描述小奇欺負同學的行為，其記錄內容不會涵蓋下列哪個部份？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)記錄者的姓名', 'img': ''},
                'B': {'text': '(B)攻擊事件的描述', 'img': ''},
                'C': {'text': '(C)小奇的家長職業', 'img': ''},
                'D': {'text': '(D)攻擊發生情境的描述', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {'text': '甲生和乙生同時都聽到丙生說：「地上有玩具，小花沒看到玩具，小花跌倒了。」甲生和乙生都說小花被玩具絆倒了。老師問為什麼？甲生表示丙生的話語中有提到這件事情，而乙生表示這是自己推論出來的結果。下列敘述何者最為適切？', 'img': ''},
            'Option': {
                'A': {'text': '(A)乙生比甲生更過度規則化', 'img': ''},
                'B': {'text': '(B)乙生比甲生更能整合語意', 'img': ''},
                'C': {'text': '(C)甲生比乙生更具後設語言覺\n   察', 'img': ''},
                'D': {'text': '(D)甲生比乙生更能聽出弦外之\n   音', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {
                'text': '老師告誡全班同學不准至學校廚房後面玩耍，那塊空地是活動禁區，因為雜物多，易發生危險。小凱某日練習羽毛球時，不慎將新購買的羽球擊入，心急如焚，要不要去禁區撿球？小丹說：「老師如果知道小凱踏入禁區應該會生氣，但如果老師知道，小凱是為了要撿球，就會覺得小凱走入禁區是有理由！」根據角色取替發展，小丹的判斷屬於下列哪個階段？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)相互性的角色取替', 'img': ''},
                'B': {'text': '(B)自我中心的角色取替', 'img': ''},
                'C': {'text': '(C)自我反射的角色取替', 'img': ''},
                'D': {'text': '(D)社會訊息的角色取替', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {
                'text': '根據維高思基(L. S. Vygotsky)的社會文化論，下列敘述何者錯誤？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)以鷹架搭建協助兒童學習新的知能', 'img': ''},
                'B': {'text': '(B)語言發展有助於兒童的思考心智活動及行為', 'img': ''},
                'C': {'text': '(C)兒童是主動建構形成一套有\n   組織的心智運思結構', 'img': ''},
                'D': {'text': '(D)調適是指利用原有的基模去\n   詮釋外在世界新的經驗', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '根據維高思基(L. S. Vygotsky)的社會文化論，下列敘述何者錯誤？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)以鷹架搭建協助兒童學習新\n   的知能', 'img': ''},
                'B': {'text': '(B)語言發展有助於兒童的思考\n   心智活動及行為', 'img': ''},
                'C': {'text': '(C)兒童面臨較困難任務時，其\n   私我語言便會減少 ', 'img': ''},
                'D': {'text': '(D)兒童的學習發生於近側發展區\n   (Zone of Proximal Development\n   ZPD)', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {
                'text': '25-26為題組\n閱讀下文後，回答25-26題。\n'
                        '李老師發現小強在班上較難以控制自己的情緒而具攻擊性，以致人際關係不佳，無法適應學校生活。\n\n'
                        '導致小強人際關係不佳最可能的情緒為下列何者？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)害怕', 'img': ''},
                'B': {'text': '(B)悲傷', 'img': ''},
                'C': {'text': '(C)焦慮', 'img': ''},
                'D': {'text': '(D)憤怒', 'img': ''}
            },
            "isImage": ""
        },
        26: {
            'Q': {'text': '若以五大人格特質來看，小強在下列哪一類型的特質最為明顯？\n\n'
                          '李老師發現小強在班上較難以控制自己的情緒而具攻擊性，以致人際關係不佳，無法適應學校生活。\n\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)神經質', 'img': ''},
                'B': {'text': '(B)嚴謹性', 'img': ''},
                'C': {'text': '(C)開放性', 'img': ''},
                'D': {'text': '(D)外向性', 'img': ''}
            },
            "isImage": ""
        },
        27: {
            'Q': {'text': '27-28為題組\n閱讀下文後，回答27-28題。\n'
                          '林老師在班級的親師會中，與家長做了雙向交流與溝通，希望了解家長的管教方式。其中，林老師和小美的家長懇談後，了解到家長對她要求極為嚴格，而且不容她質疑或是討論；林老師和小雄的家長懇談後則發現，父母對小雄幾乎是有求必應。\n\n'
                          '根據林老師和小美家長的交流與溝通，會認為小美父母的管教方式，係屬於下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)袖手旁觀型', 'img': ''},
                'B': {'text': '(B)獨斷專權型', 'img': ''},
                'C': {'text': '(C)民主威信型', 'img': ''},
                'D': {'text': '(D)縱容溺愛型', 'img': ''}
            },
            "isImage": ""
        },
        28: {
            'Q': {'text': '根據小雄父母對他的互動方式，下列何者是小雄最可能出現的行為表現？\n\n'
                          '林老師在班級的親師會中，與家長做了雙向交流與溝通，希望了解家長的管教方式。其中，林老師和小美的家長懇談後，了解到家長對她要求極為嚴格，而且不容她質疑或是討論；林老師和小雄的家長懇談後則發現，父母對小雄幾乎是有求必應。\n\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)成績表現較差', 'img': ''},
                'B': {'text': '(B)與同學相處人緣佳', 'img': ''},
                'C': {'text': '(C)能夠把自己照顧好', 'img': ''},
                'D': {'text': '(D)自制力和挫折容忍力低', 'img': ''}
            },
            "isImage": ""
        },
        29: {
            'Q': {'text': '29-30為題組\n閱讀下文後，回答29-30題。\n陳老師編製一個「國小學生學習策略量表」，作為小學生課業學習輔導的檢核工具。\n\n'
                          '陳老師在編製「國小學生學習策略量表」時，他以該量表的得分與樣本班級的學業成績間的相關，來建立該量表的效度。陳老師是使用哪種效度？', 'img': ''},
            'Option': {
                'A': {'text': '(A)內容效度', 'img': ''},
                'B': {'text': '(B)聚斂效度', 'img': ''},
                'C': {'text': '(C)表面效度', 'img': ''},
                'D': {'text': '(D)效標關聯效度', 'img': ''}
            },
            "isImage": ""
        },
        30: {
            'Q': {'text': '陳老師在施測「國小學生學習策略量表」完畢，間隔一週之後，又進行相同內容的重新測驗，其所求得的信度稱為下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)折半信度', 'img': ''},
                'B': {'text': '(B)複本信度', 'img': ''},
                'C': {'text': '(C)再測信度', 'img': ''},
                'D': {'text': '(D)內部一致性信度', 'img': ''}
            },
            "isImage": ""
        },
    }

    return question


def year108_2():
    question = {
        1: {
            'Q': {'text': '學校針對一般學生及適應困難學生進行一般輔導，此屬於下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)初級預防', 'img': ''},
                'B': {'text': '(B)二級預防', 'img': ''},
                'C': {'text': '(C)三級預防', 'img': ''},
                'D': {'text': '(D)生涯輔導', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '根據皮亞傑(J. Piaget)的理論，兒童在具體運思期的認知特徵是下列哪一項？', 'img': ''},
            'Option': {
                'A': {'text': '(A)推理思考', 'img': ''},
                'B': {'text': '(B)萬物有靈', 'img': ''},
                'C': {'text': '(C)欠缺可逆性', 'img': ''},
                'D': {'text': '(D)自我中心語言', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '小青的家境不好，常常讓她覺得自己不如同學，她很努力唸書，希望獲得好成績，得到老師和同學的肯定。這是屬於下列何種防衛機轉？', 'img': ''},
            'Option': {
                'A': {'text': '(A)否認', 'img': ''},
                'B': {'text': '(B)補償', 'img': ''},
                'C': {'text': '(C)替代', 'img': ''},
                'D': {'text': '(D)反向', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '下列哪一項技巧最適合用於訓練兒童解決人際關係問題？', 'img': ''},
            'Option': {
                'A': {'text': '(A)避免情緒衝動', 'img': ''},
                'B': {'text': '(B)如何取悅他人', 'img': ''},
                'C': {'text': '(C)對問題快速反應', 'img': ''},
                'D': {'text': '(D)思考解決的方式', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {
                'text': '小華一直被班上其他的男同學嘲笑太娘娘腔，面對小華這樣的男孩，下列老師可以提供的協助，何者最適切？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)幫助他學習男性化的行為', 'img': ''},
                'B': {'text': '(B)幫助他接納自己，強化其適\n   應能力 ', 'img': ''},
                'C': {'text': '(C)提醒他要小心，這樣可能會\n   不受歡迎', 'img': ''},
                'D': {'text': '(D)要他減少和女性相處，以避\n   免模仿女性化的行為', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {
                'text': '有關注意力缺陷過動症(ADHD)兒童的敘述，下列何者正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)ADHD兒童的治療藥物通常是\n   興奮劑', 'img': ''},
                'B': {'text': '(B)ADHD兒童女孩與男孩的比例\n   大致相當', 'img': ''},
                'C': {'text': '(C)ADHD兒童的學業成績與人際\n   關係大致不受影響', 'img': ''},
                'D': {'text': '(D)大部分ADHD兒童進入青春期\n   後，症狀會逐漸改善甚至痊\n   癒', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '小偉的國語成就測驗得40分，對照年級常模換算為百分等級90。這代表的意義是下列何者？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)該年級國語常模的平均分數\n   為 36 分', 'img': ''},
                'B': {'text': '(B)小偉的國語成就勝過百分之\n   十的學生', 'img': ''},
                'C': {'text': '(C)小偉的國語成就勝過百分之\n   九十的學生', 'img': ''},
                'D': {'text': '(D)有百分之九十該年級的學生\n   國語成績達 40 分', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {
                'text': '依據佛洛依德(S. Freud)的理論，人類的所有行為皆是由哪些驅力所產生？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)性與固著', 'img': ''},
                'B': {'text': '(B)性與攻擊', 'img': ''},
                'C': {'text': '(C)固著與攻擊', 'img': ''},
                'D': {'text': '(D)壓抑與慾力', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {
                'text': '有關自閉症兒童的敘述，下列何者正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)自閉症兒童偏好生活上的變\n   化、調整', 'img': ''},
                'B': {'text': '(B)自閉症兒童會表現出自我刺\n   激的動作', 'img': ''},
                'C': {'text': '(C)自閉症兒童經過適當治療將\n   無異於一般兒童', 'img': ''},
                'D': {'text': '(D)輕度自閉症兒童的治療重點\n   是建立自我照顧技能', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {
                'text': '學生在課堂上搗亂，藉以引起老師的關注。如果老師予以忽略，就可以降低學生下次在課堂搗亂的動機。試問老師是運用下列何種行為改變的策略？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)消弱', 'img': ''},
                'B': {'text': '(B)懲罰', 'img': ''},
                'C': {'text': '(C)正增強', 'img': ''},
                'D': {'text': '(D)負增強', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {
                'text': '有關兒童生理轉變的敘述，下列何者錯誤？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)生長速率及性成熟的時間，\n   男孩和女孩都有明顯的個別\n   差異', 'img': ''},
                'B': {'text': '(B)平均而言，已開發國家兒童\n   的體型，比開發中國家兒童\n   高大', 'img': ''},
                'C': {'text': '(C)近百年來，女孩達到性成熟\n   的年齡提早了，男孩則沒什\n   麼改變', 'img': ''},
                'D': {'text': '(D)性成熟的時間，主要受先天\n   基因的影響，但後天環境也\n   會促成其改變', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '小志的身高異乎一般學童，甚至疑似巨人症。導致這種異常發育現象的主要原因，可能是小志的哪個內分泌腺失調所致？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)性腺', 'img': ''},
                'B': {'text': '(B)腎上腺', 'img': ''},
                'C': {'text': '(C)松果腺', 'img': ''},
                'D': {'text': '(D)腦下腺', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {'text': '四年級的小薇上臺做口頭報告時，都會因過度緊張而說不出話來。老師為了幫助她克服焦慮，就請小薇從上臺跟同學點頭微笑開始，然後進一步上臺說一句話，逐漸增加報告長度，做到後給予鼓勵。老師的作法是運用下列何種諮商學派？', 'img': ''},
            'Option': {
                'A': {'text': '(A)行為學派', 'img': ''},
                'B': {'text': '(B)阿德勒學派', 'img': ''},
                'C': {'text': '(C)個人中心學派', 'img': ''},
                'D': {'text': '(D)心理分析學派', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {
                'text': '十歲的小美因父母離婚心情沮喪而接受輔導，小美的媽媽希望輔導老師能在不告知小美的情況下，讓她知道小美輔導的內容。根據輔導專業倫理原則，輔導老師該如何做最恰當？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)為了個案最大的權益，所以\n   告知小美媽媽輔導內容', 'img': ''},
                'B': {'text': '(B)因為個案未成年，輔導老師\n   有義務告知家長輔導內容', 'img': ''},
                'C': {'text': '(C)為了尊重個案的權利，應先\n   徵求小美的同意，再跟小美\n   媽媽說明', 'img': ''},
                'D': {'text': '(D)為了對個案談話內容保密，\n   可避重就輕、簡略的向小美\n   媽媽說明', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {
                'text': '小智的學習成就低落，他覺得自己就是笨，學不會，因此對學習失去興趣。下列何者最能提升小智的學習動機？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)實施課後補救教學', 'img': ''},
                'B': {'text': '(B)只要成績退步就給予懲罰', 'img': ''},
                'C': {'text': '(C)鼓勵只要努力就可以贏過別\n   人', 'img': ''},
                'D': {'text': '(D)協助他設定適切易達成的目\n   標', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '小安下課時常和同學打架，故意把同學的東西弄壞，偷總務股長保管的班費，上課會趁機溜出教室，甚至破壞學校的設施。小安的行為最可能屬於下列哪種困擾行為？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)行為規範障礙', 'img': ''},
                'B': {'text': '(B)妥瑞氏症', 'img': ''},
                'C': {'text': '(C)對立性反抗疾患', 'img': ''},
                'D': {'text': '(D)注意力缺陷過動症', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {
                'text': '三個月前小凱放學回家看到母親因心臟病發作而倒在地上，他機警地打電話求助，可惜在送醫後母親還是不治。從那時候開始，小凱腦中常常浮現回家見到母親的那一幕，也出現注意力不集中、睡不著、容易受驚嚇、功課退步、對未來悲觀以及對周圍的事物不感興趣等現象。小凱的狀況最合乎下列何種診斷？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)社會畏懼症', 'img': ''},
                'B': {'text': '(B)急性壓力疾患', 'img': ''},
                'C': {'text': '(C)廣泛性焦慮疾患', 'img': ''},
                'D': {'text': '(D)創傷後壓力疾患', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {
                'text': '小芳與小誠具有同樣的心理年齡。王老師想要了解他們問題解決能力的差異，在解決問題時，王老師在過程中給予相同的引導與幫助，小芳很快的解決超過其心理年齡兩歲的問題，而小誠只能解決超過其心理年齡半歲的問題。試問王老師最可能採用下列何種評量方式？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)合作評量', 'img': ''},
                'B': {'text': '(B)傳統評量', 'img': ''},
                'C': {'text': '(C)實作評量', 'img': ''},
                'D': {'text': '(D)動態評量', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {
                'text': '請小朋友描述自己的時候，小英說：「我是女生，我六歲」。她的回應呈現了下列哪一個概念？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)內在自我\n   (inner self)', 'img': ''},
                'B': {'text': '(B)延伸自我\n   (extended self)', 'img': ''},
                'C': {'text': '(C)類別自我\n   (categorical self)', 'img': ''},
                'D': {'text': '(D)鏡中自我\n   (looking-glass self)', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {
                'text': '五年級的小雄經常不寫功課，被父母、師長責罵，也常遭同學譏笑，造成他不喜歡上學讀書。依據艾瑞克森(E. Erikson)的心理社會發展理論，小雄目前的發展危機是下列何者？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)罪惡感', 'img': ''},
                'B': {'text': '(B)自貶自卑', 'img': ''},
                'C': {'text': '(C)退縮愧疚', 'img': ''},
                'D': {'text': '(D)角色混淆', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {
                'text': '有關內隱(implicit)認知的說法，下列敘述何者正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)許多學習和記憶的作業在內\n   隱認知的狀態下表現最好', 'img': ''},
                'B': {'text': '(B)內隱記憶隨年齡而有提升的\n   趨勢，年齡越大則內隱記憶\n   越好', 'img': ''},
                'C': {'text': '(C)內隱學習是早期發展的能力\n   ，學齡階段的兒童沒有明顯\n   的改變', 'img': ''},
                'D': {'text': '(D)內隱學習和外顯學習一樣，\n   需要透過明顯覺察才能獲得\n   新知識', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {
                'text': '張老師發現三年級的小翔維持注意的能力不佳。從神經學的角度，可能是下列哪一個區域尚未發展完備？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)杏仁核\n   (amygdala)', 'img': ''},
                'B': {'text': '(B)海馬迴\n   (hippocampus)', 'img': ''},
                'C': {'text': '(C)下視丘\n   (hypothalamus)', 'img': ''},
                'D': {'text': '(D)網狀結構\n   (reticular formation)', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {
                'text': '小梅想跟同學去逛街看電影，媽媽覺得不妥，就和小梅討論，並解釋她不同意的理由。小梅媽媽使用的教養方式，就控制和關懷兩個層面來看，屬於下列何種特質？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)高控制與高關懷', 'img': ''},
                'B': {'text': '(B)低控制與高關懷', 'img': ''},
                'C': {'text': '(C)高控制與低關懷', 'img': ''},
                'D': {'text': '(D)低控制與低關懷', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '小馨上課極少主動發言，下課時都是一個人靜靜坐在位子上。最近，她常常向接她回家的奶奶抱怨上學很有壓力，不想到學校去。小馨所表現出來的問題，最傾向於下列何項適應困難型態？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)外向性行為', 'img': ''},
                'B': {'text': '(B)內向性行為', 'img': ''},
                'C': {'text': '(C)不良習癖行為', 'img': ''},
                'D': {'text': '(D)學業適應問題', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {
                'text': '小傑喜歡小昇的玩具，因此伸手推打小昇搶走玩具；小樺認為小立對自己不懷好意，常常說話諷刺小立。請問小傑與小樺的行為分別屬於何種攻擊行為的類型？\n甲、關係性攻擊\n乙、工具性攻擊\n丙、敵意性攻擊\n丁、反應性攻擊\n',
                'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丙', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)丙丁', 'img': ''}
            },
            "isImage": ""
        },
        26: {
            'Q': {'text': '四年級的小銘和同學去速食餐廳吃東西，坐定之後發現自己的餐盤裡多了一杯可樂和一包薯條。小銘說：「這些不是我點的食物，應該還回去，老師說占為己有不是好行為。」從柯柏格(L. Kohlberg)道德發展理論來看，小銘處於哪一個發展階段？', 'img': ''},
            'Option': {
                'A': {'text': '(A)避罰服從取向', 'img': ''},
                'B': {'text': '(B)相對功利取向', 'img': ''},
                'C': {'text': '(C)尋求認可取向', 'img': ''},
                'D': {'text': '(D)法制觀念取向', 'img': ''}
            },
            "isImage": ""
        },
        27: {
            'Q': {'text': '27-28為題組\n閱讀下文後，回答27-28題。\n'
                          '十歲的兒童被要求記憶一連串的名詞：沙發、黃狗、香蕉、椅子、蘋果、老鼠、桌子、橘子、黑貓，他們多數會把這些名詞分成家具、水果、動物三類，然後依據這三類做記憶。\n\n'
                          '他們使用了下列何種記憶策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)複誦(rehearsal)', 'img': ''},
                'B': {'text': '(B)組織(organization)', 'img': ''},
                'C': {'text': '(C)精緻化(elaboration)', 'img': ''},
                'D': {'text': '(D)後設記憶(metamemory)', 'img': ''}
            },
            "isImage": ""
        },
        28: {
            'Q': {'text': '有關兒童記憶策略的使用，下列敘述何者不正確？\n\n'
                          '十歲的兒童被要求記憶一連串的名詞：沙發、黃狗、香蕉、椅子、蘋果、老鼠、桌子、橘子、黑貓，他們多數會把這些名詞分成家具、水果、動物三類，然後依據這三類做記憶。\n\n',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)策略的使用有其發展特徵', 'img': ''},
                'B': {'text': '(B)策略的使用是需要學習的', 'img': ''},
                'C': {'text': '(C)年長的兒童較能夠隨情境彈\n   性使用不同策略', 'img': ''},
                'D': {'text': '(D)兒童初次習得某種記憶策略\n   後，即可類化使用於各種情\n   境', 'img': ''}
            },
            "isImage": ""
        },
        29: {
            'Q': {'text': '29-30為題組\n閱讀下文後，回答29-30題。\n'
                          '老師：「你看起來很不開心，有想要和我談談嗎？」\n小祥：「考試快到了！功課這麼多，我都還沒唸，怎麼辦？」\n老師：「考試快到了，你擔心功課唸不完，不知道該怎麼辦？」\n小祥：「是啊！為了考試我很煩惱，我不喜歡考試。」\n'
                          '老師採用的回應方式為下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)真誠', 'img': ''},
                'B': {'text': '(B)尊重', 'img': ''},
                'C': {'text': '(C)同理心', 'img': ''},
                'D': {'text': '(D)具體化', 'img': ''}
            },
            "isImage": ""
        },
        30: {
            'Q': {'text': '老師採用的回應方式最符合下列何種學派？\n\n'
                          '老師：「你看起來很不開心，有想要和我談談嗎？」\n小祥：「考試快到了！功課這麼多，我都還沒唸，怎麼辦？」\n老師：「考試快到了，你擔心功課唸不完，不知道該怎麼辦？」\n小祥：「是啊！為了考試我很煩惱，我不喜歡考試。」\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)心理分析', 'img': ''},
                'B': {'text': '(B)個人中心', 'img': ''},
                'C': {'text': '(C)存在主義', 'img': ''},
                'D': {'text': '(D)認知行為', 'img': ''}
            },
            "isImage": ""
        },
    }

    return question


def year108_1():
    question = {
        1: {
            'Q': {'text': '為評估兒童心理健康情形，可採用下列哪一種心理測驗？', 'img': ''},
            'Option': {
                'A': {'text': '(A)中華畫人測驗', 'img': ''},
                'B': {'text': '(B)主題情境測驗', 'img': ''},
                'C': {'text': '(C)國小學童生活適應量表', 'img': ''},
                'D': {'text': '(D)愛德華斯個人興趣量表', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '教師若想要培養學生的創造力，下列何種作法最可能達到效果？', 'img': ''},
            'Option': {
                'A': {'text': '(A)教師要有權威感，學生才能\n   認真學習專心思考', 'img': ''},
                'B': {'text': '(B)要不斷練習基本題型，以使\n   學生反應變快變靈敏', 'img': ''},
                'C': {'text': '(C)鼓勵學生自由交換意見及嘗\n   試各種不同的學習方式', 'img': ''},
                'D': {'text': '(D)教材的深度加深，使學生的\n   知識廣博，才能促進聯想', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '下列何者是兒童期情緒起伏的主要特色？', 'img': ''},
            'Option': {
                'A': {'text': '(A)情緒來得快，去得慢', 'img': ''},
                'B': {'text': '(B)情緒來得快，去得快', 'img': ''},
                'C': {'text': '(C)情緒起伏小，不明顯', 'img': ''},
                'D': {'text': '(D)情緒兩極化，變化明顯', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '三年級的小英智力測驗結果為智商99，但是她的學業成績落後同學很多，相當於同年級學生百分等級20 的相對地位。下列何者最能描述小英的狀況？', 'img': ''},
            'Option': {
                'A': {'text': '(A)智能不足', 'img': ''},
                'B': {'text': '(B)學習低成就', 'img': ''},
                'C': {'text': '(C)數學學習障礙', 'img': ''},
                'D': {'text': '(D)注意力缺陷過動症', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {
                'text': '剛轉學的小謙，在學校常出現不說話、害怕、耍賴等行為，但在家裡生活適應卻非常正常。他的行為困擾最符合下列何者？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)學校恐懼症', 'img': ''},
                'B': {'text': '(B)分離焦慮症', 'img': ''},
                'C': {'text': '(C)選擇性緘默症', 'img': ''},
                'D': {'text': '(D)特定對象恐懼症', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {
                'text': '小華考試成績很差，卻經常對同學說：「老師出題太難、評分不公平。」依據精神分析學派的觀點，小華的行為是屬於下列何種防衛機轉？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)否認\n   (denial)', 'img': ''},
                'B': {'text': '(B)投射\n   (projection)', 'img': ''},
                'C': {'text': '(C)合理化\n   (rationalization)', 'img': ''},
                'D': {'text': '(D)反向\n   (reaction formation)', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '有關肥胖兒童的敘述，下列何者正確？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)睡眠不足會增加肥胖的可能\n   性', 'img': ''},
                'B': {'text': '(B)兒童期的肥胖問題不致影響\n   其長期的健康', 'img': ''},
                'C': {'text': '(C)相較於較瘦的兒童，肥胖兒\n   童的自尊較高', 'img': ''},
                'D': {'text': '(D)兒童的基礎代謝率高，即使\n   久坐也不致肥胖', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {
                'text': '心理學家維高思基(L. S. Vygotsky)認為七歲以後的兒童，能夠透過高層次心智運作進行自我引導式思考與溝通，這種現象稱為下列何者？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)內在語言\n   (inner speech)', 'img': ''},
                'B': {'text': '(B)電報語言\n   (telegraphic speech)', 'img': ''},
                'C': {'text': '(C)接收型語言\n   (receptive speech)', 'img': ''},
                'D': {'text': '(D)自我中心語言\n   (egocentric speech)', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {
                'text': '李老師發現班上小莉的家庭屬於混合家庭(blended family)，下列敘述何者正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)小莉的家庭為三代同堂', 'img': ''},
                'B': {'text': '(B)小莉的家庭為重組家庭', 'img': ''},
                'C': {'text': '(C)小莉同時擁有繼父和繼母', 'img': ''},
                'D': {'text': '(D)小莉的父母共同監護小莉', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {
                'text': '陳老師規劃全校學生輔導工作計畫，以促進學生心理健康與社會適應。此計畫最符合下列哪一項輔導？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)發展性輔導', 'img': ''},
                'B': {'text': '(B)介入性輔導', 'img': ''},
                'C': {'text': '(C)處遇性輔導', 'img': ''},
                'D': {'text': '(D)危機性輔導', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {
                'text': '根據「兒童及少年福利與權益保障法」，學校人員發現國小學生施用毒品，須於多少小時內向當地政府通報？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)12', 'img': ''},
                'B': {'text': '(B)24', 'img': ''},
                'C': {'text': '(C)36', 'img': ''},
                'D': {'text': '(D)48', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '下列有關小瑞對輔導教師的談話內容，何者不須保密？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)提到他有次考試作弊', 'img': ''},
                'B': {'text': '(B)提到在家中，爸爸常常打他\n   和媽媽', 'img': ''},
                'C': {'text': '(C)提到他喜歡某一位女同學，\n   曾偷偷寫信給她', 'img': ''},
                'D': {'text': '(D)提到他討厭自然課，私下取\n   老師難聽的綽號', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {
                'text': '根據皮亞傑(J. Piaget)的認知發展理論，兒童尋找問題答案時，如果可以忽略誤導的表象並且注意一個以上相關的面向，代表此兒童已具備下列何種現象的能力？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)可逆性', 'img': ''},
                'B': {'text': '(B)泛靈論', 'img': ''},
                'C': {'text': '(C)因果關係', 'img': ''},
                'D': {'text': '(D)去集中化', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {
                'text': '有關兒少遭到性侵害的敘述，下列何者正確？\n甲、遭到性侵害的兒少可能會有憂鬱傾向\n乙、真誠傾聽遭到性侵害兒少的感受是輔導他們的方法之一\n丙、若遇到遭性侵害兒少不願舉發其親人為加害者時，則不得逕予舉發\n丁、發生兒少性侵害事件，應先得到兒少家人的同意才能進行通報作業\n',
                'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)乙丙', 'img': ''},
                'C': {'text': '(C)乙丁', 'img': ''},
                'D': {'text': '(D)丙丁', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {
                'text': '小倫不自覺地將輔導教師視為母親，產生依賴感，希望得到無微不至的照顧。這是屬於下列哪一種現象？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)抗拒作用', 'img': ''},
                'B': {'text': '(B)認知謬誤', 'img': ''},
                'C': {'text': '(C)移情作用', 'img': ''},
                'D': {'text': '(D)遷移作用', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '下列何者是柯柏格(L. Kohlberg)對兒童道德發展所持的觀點？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)道德發展具有普遍性的原則', 'img': ''},
                'B': {'text': '(B)兩性道德判斷的標準不一致', 'img': ''},
                'C': {'text': '(C)道德由模仿或增強的方式所\n   習得', 'img': ''},
                'D': {'text': '(D)道德會受特定文化的規範所\n   影響', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {
                'text': '有關「學生輔導法」中對學生輔導工作的敘述，下列何者不正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)校長負有輔導學生之責任', 'img': ''},
                'B': {'text': '(B)國小應設學生輔導工作委員\n   會', 'img': ''},
                'C': {'text': '(C)國小輔導人員指的是專任輔\n   導教師', 'img': ''},
                'D': {'text': '(D)一般教師主要負責執行發展\n   性的輔導措施', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {
                'text': '小澄與小清是同卵雙生，小澄自小比較愛笑，所以爸媽逗弄他比較多，長大後小澄比較喜歡發言、跟人互動，而小清則比較安靜。此現象最符合發展歷程中的哪一概念？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)利基選擇\n   (niche-picking)', 'img': ''},
                'B': {'text': '(B)基因漸成作用\n   (epigenesis)', 'img': ''},
                'C': {'text': '(C)基因環境交互作用\n   (gene environment interaction)', 'img': ''},
                'D': {'text': '(D)非共同環境的影響\n   (nonshared environmental influence)', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {
                'text': '小美自幼在美國成長，而小傑自幼在臺灣成長。兩人接受自我概念的測量，下列有關出現個人主義特質和社會/關係特質的敘述，何者最為適切？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)兩人出現個人主義特質的可\n   能性相等', 'img': ''},
                'B': {'text': '(B)兩人出現社會/關係特質的\n   可能性相等', 'img': ''},
                'C': {'text': '(C)小美出現社會/關係特質的\n   可能性較高', 'img': ''},
                'D': {'text': '(D)小美出現個人主義特質的可\n   能性較高', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {
                'text': '當妹妹表現助人行為時，哥哥就送一張她最喜歡的棒球卡，妹妹為了想得到棒球卡而繼續助人。由此推知，妹妹最可能處於柯柏格(L. Kohlberg)的道德認知發展的哪一個階段？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)避罰服從導向', 'img': ''},
                'B': {'text': '(B)尋求認可導向', 'img': ''},
                'C': {'text': '(C)相對功利導向', 'img': ''},
                'D': {'text': '(D)順從權威導向', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {
                'text': '八歲的小欣聽到三歲的弟弟指著小狗說：「跳舞可愛」時，馬上回應弟弟：「對！狗狗跳舞很可愛」。小欣修正弟弟語言表達的方式，稱為下列何者？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)重述\n   (recast)', 'img': ''},
                'B': {'text': '(B)擴張\n   (expansion)', 'img': ''},
                'C': {'text': '(C)句法提攜\n   (syntactic bootstrapping)', 'img': ''},
                'D': {'text': '(D)語義提攜\n   (semantic bootstrapping)', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {
                'text': '張老師編製一份評量工具，以提供輔導人員或教師對學生社會互動行為的表現，進行不同等級的評估。張老師所編製的工具最符合下列何者？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)檢核表', 'img': ''},
                'B': {'text': '(B)評定量表', 'img': ''},
                'C': {'text': '(C)自陳式量表', 'img': ''},
                'D': {'text': '(D)軼事記錄表', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {
                'text': '小花的學習成就低落，她認為自己笨，學不會。小花對自己學習低落的歸因模式為下列何者？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)內在-可控制的因素', 'img': ''},
                'B': {'text': '(B)外在-可控制的因素', 'img': ''},
                'C': {'text': '(C)內在-不可控制的因素', 'img': ''},
                'D': {'text': '(D)外在-不可控制的因素', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '「讚美」是一種增強(reinforcement)技巧，有效的讚美能激勵學童提昇自信。下列敘述中，何者是最有效的讚美？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)加油！盡力就好，你已經很\n   棒了！', 'img': ''},
                'B': {'text': '(B)你真聰明，這項作品做的真\n   好，令人佩服。', 'img': ''},
                'C': {'text': '(C)你的畫作畫得很好！前途無\n   量！肯定能成為一個藝術家！', 'img': ''},
                'D': {'text': '(D)你很努力準備考試，閱讀指\n   定的內容，也摘錄重點還做\n   了自我測試！', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {
                'text': '小英是家中三姊妹的老大，父親長年臥病，家中經濟靠母親在外工作維持，因而家中照顧爸爸和妹妹的責任多由小英協助承擔，使小英於同儕之間顯得相對成熟許多。\n小英的行為表現，最符合下列哪一種類型？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)親職化兒童', 'img': ''},
                'B': {'text': '(B)代罪羔羊兒童', 'img': ''},
                'C': {'text': '(C)小飛俠症兒童', 'img': ''},
                'D': {'text': '(D)跨世代聯盟兒童', 'img': ''}
            },
            "isImage": ""
        },
        26: {
            'Q': {
                'text': '國小六年級的小安一直還記得在幼兒園放學回家時，在巷口被一隻黑狗猛叫窮追，因此他每到巷口時就感到害怕，產生「一朝被蛇咬、十年怕草繩」的現象。小安的反應與下列哪些腦區的功能最相關？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)松果體', 'img': ''},
                'B': {'text': '(B)腦下垂體', 'img': ''},
                'C': {'text': '(C)視丘與下視丘', 'img': ''},
                'D': {'text': '(D)海馬迴與杏仁核', 'img': ''}
            },
            "isImage": ""
        },
        27: {
            'Q': {'text': '27-28為題組\n閱讀下文後，回答27-28題。\n'
                          '八歲的小明上課常常分心、坐不住，想到什麼就說什麼，做事粗心大意又衝動、沒耐心，常與同學衝突、吵架。\n'
                          '小明的行為問題最可能屬於下列哪一類？', 'img': ''},
            'Option': {
                'A': {'text': '(A)焦慮疾患', 'img': ''},
                'B': {'text': '(B)學業適應問題', 'img': ''},
                'C': {'text': '(C)內向性行為問題', 'img': ''},
                'D': {'text': '(D)外向性行為問題', 'img': ''}
            },
            "isImage": ""
        },
        28: {
            'Q': {'text': '如果教師與小明建立無條件地接納、真誠、尊重的關係，試問教師的作法是運用下列哪一諮商學派的取向？\n\n'
                          '八歲的小明上課常常分心、坐不住，想到什麼就說什麼，做事粗心大意又衝動、沒耐心，常與同學衝突、吵架。\n',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)行為取向', 'img': ''},
                'B': {'text': '(B)人本取向', 'img': ''},
                'C': {'text': '(C)認知行為取向', 'img': ''},
                'D': {'text': '(D)心理動力取向', 'img': ''}
            },
            "isImage": ""
        },
        29: {
            'Q': {'text': '29-30為題組\n閱讀下文後，回答29-30題。\n'
                          '十歲的小方收下自己不喜歡的生日禮物後，即使並不開心，仍微笑著向對方道謝。\n'
                          '這表示小方已具備下列何種能力的發展？', 'img': ''},
            'Option': {
                'A': {'text': '(A)互惠關係', 'img': ''},
                'B': {'text': '(B)延宕滿足', 'img': ''},
                'C': {'text': '(C)抗拒誘惑', 'img': ''},
                'D': {'text': '(D)情緒調節', 'img': ''}
            },
            "isImage": ""
        },
        30: {
            'Q': {'text': '小方的表現與大腦中哪一區塊的功能關係最密切？\n\n'
                          '十歲的小方收下自己不喜歡的生日禮物後，即使並不開心，仍微笑著向對方道謝。',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)頂葉', 'img': ''},
                'B': {'text': '(B)枕葉', 'img': ''},
                'C': {'text': '(C)額葉', 'img': ''},
                'D': {'text': '(D)顳葉', 'img': ''}
            },
            "isImage": ""
        },
    }

    return question


def year106():
    pass


def year105():
    pass


def year104():
    pass


def year103():
    pass


def year102():
    pass


def year101():
    pass


def year100():
    pass


def year99():
    pass


def year98():
    pass


def year97():
    pass


def year96():
    pass


def year95():
    pass


def year94():
    pass


# print(create_template(25))
YEARS = [
    year112(), year111(), year110(), year109(), year108_2(),
    year108_1(), year106(), year105(), year104(), year103(),
    year102(), year101(), year100(), year99(), year98(),
    year97(), year96(), year95(), year94()
]
