def create_template(count):
    d = dict()
    for i in range(1, count + 1):
        d[i] = {
            "Q": {
                "text": "", "img": ""
            },
            "Option": {
                "A": {"text": "", "img": ""},
                "B": {"text": "", "img": ""},
                "C": {"text": "", "img": ""},
                "D": {"text": "", "img": ""}
            },
            "isImage": ""
        }

    return d


def year112():
    question = {
        1: {
            'Q': {'text': '下列大腦區域何者與情緒控制較有關係？', 'img': ''},
            'Option': {
                'A': {'text': '(A)額葉', 'img': ''},
                'B': {'text': '(B)頂葉', 'img': ''},
                'C': {'text': '(C)枕葉', 'img': ''},
                'D': {'text': '(D)顳葉', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '下列何者是指「透過各種社會互動經驗，人們逐漸形成一組對自己優點、缺點、能力、態度、與價值等的整體性知覺」？', 'img': ''},
            'Option': {
                'A': {'text': '(A)自我概念 (self-concept)', 'img': ''},
                'B': {'text': '(B)自我效能 (self-efficacy)', 'img': ''},
                'C': {'text': '(C)自我監控 (self-monitoring)', 'img': ''},
                'D': {'text': '(D)自我管理 (self-management)', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '二年級的小華被診斷為「注意力缺陷過動症」(ADHD) 的「注意力不集中型」(inattention)。根據診斷，下列何者較不可能是小華會出現的臨床症狀？', 'img': ''},
            'Option': {
                'A': {'text': '(A)經常無法仔細注意細節', 'img': ''},
                'B': {'text': '(B)在日常生活中常忘東忘西', 'img': ''},
                'C': {'text': '(C)經常無法遵循指示完成功課', 'img': ''},
                'D': {'text': '(D)經常在問題還沒說完時衝口說出答案', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '老師在教「長度」概念時，要學生在三分鐘內想出十種測量長度的方法，小雄想到的比其他人多。小雄在創造力的哪一個層面表現突出？', 'img': ''},
            'Option': {
                'A': {'text': '(A)流暢力', 'img': ''},
                'B': {'text': '(B)獨創力', 'img': ''},
                'C': {'text': '(C)精進力', 'img': ''},
                'D': {'text': '(D)變通力', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {'text': '小慧全家從北部搬到南部，因而轉學到新學校。他很快就熟悉學校周遭的環境，能跟老師及同學有不錯的互動，也能掌握導師的期許和班規。依據史坦伯格 (R.Sternberg)的智力三元論，大智展現了哪一種智力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)情境智力\n   (contextual intelligence)', 'img': ''},
                'B': {'text': '(B)經驗智力\n   (experiential intelligence)', 'img': ''},
                'C': {'text': '(C)社交智力\n   (interpersonal intelligence)', 'img': ''},
                'D': {'text': '(D)組合智力\n   (componential intelligence)', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {'text': '下列哪些是個人中心學派治療關係的要件？\n甲、同情心\n乙、真誠一致\n丙、積極鼓勵\n丁、無條件積極關注', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)乙丁', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '下列何者不是小團體初期階段的重要目標？', 'img': ''},
            'Option': {
                'A': {'text': '(A)確立成員須共同遵守的規範', 'img': ''},
                'B': {'text': '(B)協助成員感到自己是團體的一份子', 'img': ''},
                'C': {'text': '(C)協助成員深入了解、掌握與發展自我', 'img': ''},
                'D': {'text': '(D)幫助成員建立自己參與團隊的個人目\n   標', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {'text': '學生跟老師說：「每次分組，小豪都拒絕跟我同組，他是不是在排擠我？｣下列老師的回答，何者是較具有同理心的回應？', 'img': ''},
            'Option': {
                'A': {'text': '(A)「是他自己有問題，你不要理他。｣', 'img': ''},
                'B': {'text': '(B)「你很難過，覺得自己不被接納。｣', 'img': ''},
                'C': {'text': '(C)「別這麼說，事情應該不是這樣。｣', 'img': ''},
                'D': {'text': '(D)「你這樣想，對你一點好處都沒有。｣', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {'text': '下列哪一個學派主張將諮商的目標放在具體的問題行為上，以可觀察、可測量的行為來敘述諮商的目標，且特別強調提出具體、明確的解決步驟？', 'img': ''},
            'Option': {
                'A': {'text': '(A)心理分析學派', 'img': ''},
                'B': {'text': '(B)認知治療學派', 'img': ''},
                'C': {'text': '(C)行為治療學派', 'img': ''},
                'D': {'text': '(D)個人中心學派', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {'text': '小英這次閱讀測驗考了 65 分，遠低於全班的平均成績，所以林老師讓他放學後留下接受課後輔導。老師使用交互教學法 (reciprocal teaching) 教小英摘要與提問等閱讀策略，並逐漸將責任轉移給小英。小英在一週後重寫相同測驗的複本，得到了85分。根據以上的情境，下列敘述何者錯誤？', 'img': ''},
            'Option': {
                'A': {'text': '(A)老師的作法符合維高思基\n   (L.Vygotsky)的社會文化論', 'img': ''},
                'B': {'text': '(B)老師提供的鷹架(scaffolding)有助於\n   提升小英的閱讀表現', 'img': ''},
                'C': {'text': '(C)85分代表小英的近側發展區\n   (zoneofproximal development,ZPD)', 'img': ''},
                'D': {'text': '(D)65分可視為小英近側發展區\n   (zoneofproximal development,ZPD)\n   的下限', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {'text': '老師給小元看兩個盒子，一個盒子有泡芙圖案，另一個則有糖果圖案。老師在小元面前把泡芙放入糖果圖案的盒子。這時，老師問小元：「等一下小華進來後，會到哪個盒子找泡芙吃？」老師主要想測試小元的哪一種能力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)自我調節 (self-regulating)', 'img': ''},
                'B': {'text': '(B)道德推理 (moral reasoning)', 'img': ''},
                'C': {'text': '(C)語言組成 (language making)', 'img': ''},
                'D': {'text': '(D)觀點取替 (perspective taking)', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '下列敘述何者不符合柯柏格 (L.Kohlberg) 道德發展階段論的觀點？', 'img': ''},
            'Option': {
                'A': {'text': '(A)發展階段的前後順序會因不同文化而\n   異', 'img': ''},
                'B': {'text': '(B)道德發展可依俗例(convention)分為\n   三期(levels)', 'img': ''},
                'C': {'text': '(C)發展階段所提供的道德思考架構，可\n   應用至各種情境', 'img': ''},
                'D': {'text': '(D)除了第一階段之外，各階段的發展都\n   建立在前一階段的推理之上', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {'text': '教師應依據學生不同的需求與情境來安排座位。下列何種座位安排方式較為不妥？', 'img': ''},
            'Option': {
                'A': {'text': '(A)為增加學生互動機會與提升教學效果\n   ，將桌椅排成ㄇ字型', 'img': ''},
                'B': {'text': '(B)為激勵學生更加精進，按照成績高低\n   依序安排全班的座位', 'img': ''},
                'C': {'text': '(C)運用匿名方式了解學生的人際關係，\n   作為安排座位的參考', 'img': ''},
                'D': {'text': '(D)為維護其他同學的受教權，把嚴重違\n   反紀律的學生暫時安排在教室角落', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {'text': '根據行為學派的理論，老師輔導學生從事學習時，運用哪種增強方式較有效？', 'img': ''},
            'Option': {
                'A': {'text': '(A)當學生進步時，提高增強的頻率', 'img': ''},
                'B': {'text': '(B)整個過程皆應使用立即與持續的增強', 'img': ''},
                'C': {'text': '(C)一開始先持續性增強，之後再間歇性\n   增強', 'img': ''},
                'D': {'text': '(D)一開始先間歇性增強，之後再持續性\n   增強', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {'text': '老師在前兩週的數學課教了最大公因數的概念及算法，小柏做了很多練習才終於學會。這週開始，老師開始教最小公倍數的概念及算法，結果小柏覺得很混淆，原本之前已經學會的最大公因數算法反而不會了。下列心理歷程何者較能解釋前述現象？', 'img': ''},
            'Option': {
                'A': {'text': '(A)順攝抑制\n   (proactive inhibition)', 'img': ''},
                'B': {'text': '(B)順攝助長\n   (proactive facilitation)', 'img': ''},
                'C': {'text': '(C)倒攝抑制\n   (retroactive inhibition)', 'img': ''},
                'D': {'text': '(D)倒攝助長\n   (retroactive facilitation)', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '小志要參加校外教學，前一天晚上就買好隔日的午餐（御飯糰加飲料）放在冰箱內。為了怕忘記帶午餐，特別在門把上夾了一張紙條，上面畫了一個三角形提醒自己。小志使用的是下列哪一項記憶策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)精緻化 (elaboration)', 'img': ''},
                'B': {'text': '(B)意元集組(chunking)', 'img': ''},
                'C': {'text': '(C)選擇性注意(selectiveattention)', 'img': ''},
                'D': {'text': '(D)外在記憶輔助(external memoryaids)', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {'text': '有關特定學習障礙學童的陳述，下列何者正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)學習障礙不會伴隨知覺動作障礙', 'img': ''},
                'B': {'text': '(B)學習障礙不是由智力影響而造成', 'img': ''},
                'C': {'text': '(C)學習障礙主要是由心理社會不利因素\n   所造成', 'img': ''},
                'D': {'text': '(D)學習障礙在臺灣的盛行率介於10%至\n   20%之間', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {'text': '小揚在教室奔跑時不小心把同學的水杯打翻了，以下老師的作法何者符合「邏輯後果」的管教原則？', 'img': ''},
            'Option': {
                'A': {'text': '(A)要求小揚寫班規一遍', 'img': ''},
                'B': {'text': '(B)要求小揚上台唱歌娛樂同學', 'img': ''},
                'C': {'text': '(C)要求小揚反省並檢討自己的錯誤之處', 'img': ''},
                'D': {'text': '(D)要求小揚把地板拖乾並且向同學道歉', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {'text': '小江今年六年級，第一次段考成績不理想，讓他感到失望。小江可以採取下列哪種問題中心因應策略 (problem-centeredcoping)？', 'img': ''},
            'Option': {
                'A': {'text': '(A)透過運動放鬆心情', 'img': ''},
                'B': {'text': '(B)鼓勵自己把握下次的機會', 'img': ''},
                'C': {'text': '(C)向老師或同學請教學習方法', 'img': ''},
                'D': {'text': '(D)告訴自己想開一點，分數不是最重要\n   的事', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {'text': '媽媽在小明面前向他的朋友說：「小明這次段考成績不理想，根本就是不夠用功！」回家後，小明跟媽媽說：「考試成績不理想，並不是我不認真，數學本來就很難。每次你都在你的朋友面前說我表現不好，一點都不考慮我的感受，讓我心裡很不舒服。」小明把成績不理想做何種歸因？', 'img': ''},
            'Option': {
                'A': {'text': '(A)外在而穩定', 'img': ''},
                'B': {'text': '(B)內在而穩定', 'img': ''},
                'C': {'text': '(C)外在而不穩定', 'img': ''},
                'D': {'text': '(D)內在而不穩定', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {'text': '輔導教師協助來談者明確地表達個人的感覺、經驗與行為，聚焦於來談者自己的故事，而非漫無目標的談話。這屬於何種諮商技術？', 'img': ''},
            'Option': {
                'A': {'text': '(A)澄清(clarification)', 'img': ''},
                'B': {'text': '(B)面質(confrontation)', 'img': ''},
                'C': {'text': '(C)摘要(summarization)', 'img': ''},
                'D': {'text': '(D)具體化(concreteness)', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {'text': '小家有高度的數學考試焦慮。李老師試著讓他想像會激起焦慮的考試情境，從引發輕微焦慮的情境直到引發劇烈焦慮的情境。同時引導他面對每一個情境學習放鬆、舒緩壓力，至終解除焦慮。李老師採用的是哪一種治療方法？', 'img': ''},
            'Option': {
                'A': {'text': '(A)現場暴露法', 'img': ''},
                'B': {'text': '(B)系統減敏感法', 'img': ''},
                'C': {'text': '(C)社會技巧訓練', 'img': ''},
                'D': {'text': '(D)自我肯定訓練', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {'text': '高老師班上的國輝時常會與同學發生衝突，若同學不小心碰到他或開他玩笑，他就會攻擊同學或用髒話罵同學。高老師問國輝為何如此，國輝回答：「誰叫他們要故意弄我？」根據以上敘述，國輝的適應問題較可能歸類為下列何者？', 'img': ''},
            'Option': {
                'A': {'text': '(A)學業適應問題', 'img': ''},
                'B': {'text': '(B)內向性行為問題', 'img': ''},
                'C': {'text': '(C)外向性行為問題', 'img': ''},
                'D': {'text': '(D)創傷後壓力症候群', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '七歲的怡君和媽媽及兩歲的妹妹到餐廳吃飯。用完餐後，媽媽離開座位去櫃台結帳，怡君安慰著妹妹說：「媽媽很快就回來了，不要怕，姊姊在這裡陪妳。」下列何者較能說明怡君安慰妹妹的現象？', 'img': ''},
            'Option': {
                'A': {'text': '(A)怡君能夠清楚意識到自己的情緒', 'img': ''},
                'B': {'text': '(B)怡君對於自己的情緒調節掌握得很好', 'img': ''},
                'C': {'text': '(C)怡君非常遵守文化中情緒表達的規則', 'img': ''},
                'D': {'text': '(D)怡君能根據過去經驗預測並理解妹妹\n   的情緒', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {'text': '五年級的小貞和小惠是好朋友，他們常常聊天分享生活點滴。最近小貞的父母發生一些爭吵，小貞和小惠每天談論父母的問題，他們的心情也因此跟著低落下來。此一現象符應下列哪一個概念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)同儕壓力\n   (peerpressure)', 'img': ''},
                'B': {'text': '(B)共同反芻\n   (co-rumination)', 'img': ''},
                'C': {'text': '(C)替代學習\n   (vicarious learning)', 'img': ''},
                'D': {'text': '(D)負增強陷阱\n   (negativereinforcement trap)', 'img': ''}
            },
            "isImage": ""
        }
    }

    return question


def year111():
    question = {
        1: {
            'Q': {'text': '依據艾瑞克森(E. Erikson)的心理社會發展理論，下列何者是學齡期兒童發展的核心議題？', 'img': ''},
            'Option': {
                'A': {'text': '(A)勤奮對自卑\n   (industry vs. inferiority)', 'img': ''},
                'B': {'text': '(B)自動自發對內疚\n   (initiative vs. guilt)', 'img': ''},
                'C': {'text': '(C)自主對羞愧懷疑\n   (autonomy vs. shame and doubt)', 'img': ''},
                'D': {'text': '(D)自我認同對角色混淆\n   (identity vs. role confusion)', 'img': ''}
            },
            "isImage": ""
        },
        2: {
            'Q': {'text': '小光常有上課不專心、容易衝動發言、做事缺乏計畫性等行為表現。他最有可能是哪一腦區的功能有所缺損？', 'img': ''},
            'Option': {
                'A': {'text': '(A)胼胝體', 'img': ''},
                'B': {'text': '(B)邊緣系統', 'img': ''},
                'C': {'text': '(C)顳葉皮質區', 'img': ''},
                'D': {'text': '(D)前額葉皮質區', 'img': ''}
            },
            "isImage": ""
        },
        3: {
            'Q': {'text': '下列哪一種方法不適合用於評量學齡兒童的口語敘事能力？', 'img': ''},
            'Option': {
                'A': {'text': '(A)背誦詩詞', 'img': ''},
                'B': {'text': '(B)自述經驗', 'img': ''},
                'C': {'text': '(C)自我介紹', 'img': ''},
                'D': {'text': '(D)看圖說故事', 'img': ''}
            },
            "isImage": ""
        },
        4: {
            'Q': {'text': '下列敘述何者不屬於網路成癮的核心徵兆？', 'img': ''},
            'Option': {
                'A': {'text': '(A)上網時間越來越長', 'img': ''},
                'B': {'text': '(B)無法克制上網的衝動', 'img': ''},
                'C': {'text': '(C)不喜歡網路人際互動', 'img': ''},
                'D': {'text': '(D)不能上網時出現身心症狀', 'img': ''}
            },
            "isImage": ""
        },
        5: {
            'Q': {
                'text': '根據現行《學生輔導法》的規範，下列何者不是發展性輔導的工作內容？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)生活輔導', 'img': ''},
                'B': {'text': '(B)學習輔導', 'img': ''},
                'C': {'text': '(C)家庭輔導', 'img': ''},
                'D': {'text': '(D)生涯輔導', 'img': ''}
            },
            "isImage": ""
        },
        6: {
            'Q': {'text': '當家長向教師抱怨功課太多時，教師以下列何種方式處理較為適當？', 'img': ''},
            'Option': {
                'A': {'text': '(A)努力說服家長，強調自己功課出得多\n   ，是為了學生成績著想', 'img': ''},
                'B': {'text': '(B)了解原因並說明用意，待了解其他學\n   生狀況後，再評估調整', 'img': ''},
                'C': {'text': '(C)利用家長日，讓全班家長充分討論，\n   再表決是否減少功課量', 'img': ''},
                'D': {'text': '(D)因為家長已反映意見，擔心其向校方\n   申訴，最好減少功課量', 'img': ''}
            },
            "isImage": ""
        },
        7: {
            'Q': {'text': '胖虎經常在班上辱罵、欺負大雄，使得大雄害怕上學。下列處理方式何者較不正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)校方可以不受請假相關規定之限制\n   ，彈性處理大雄之出缺勤紀錄', 'img': ''},
                'B': {'text': '(B)為了給予雙方當事人陳述意見之機\n   會，應盡可能讓大雄與胖虎對質', 'img': ''},
                'C': {'text': '(C)校方得知疑似霸凌事件，應於三工\n   作日內召開防制校園霸凌因應小組\n   會議', 'img': ''},
                'D': {'text': '(D)校方在不知情的情況下，如果大雄\n   以匿名書面申請調查，學校得不受\n   理', 'img': ''}
            },
            "isImage": ""
        },
        8: {
            'Q': {'text': '育之把自己的座位弄得髒亂不堪，老師除了請他把座位清理乾淨，還要求他把教室打掃一遍。這是下列何種機制的應用？', 'img': ''},
            'Option': {
                'A': {'text': '(A)負增強', 'img': ''},
                'B': {'text': '(B)饜足法', 'img': ''},
                'C': {'text': '(C)反應代價', 'img': ''},
                'D': {'text': '(D)過度矯正', 'img': ''}
            },
            "isImage": ""
        },
        9: {
            'Q': {'text': '哲琦對輔導老師說：「我爸是老師，爸媽離婚後，爸爸再婚。新媽媽不喜歡別人知道我是爸爸的孩子，不准我在別人面前喊『爸爸』，要叫爸爸『老師』。很多時候我都去祖父母家住。」下列輔導老師的回應，哪一項較符合「初層次同理心」？', 'img': ''},
            'Option': {
                'A': {'text': '(A)你是否曾有逃家的念頭？', 'img': ''},
                'B': {'text': '(B)有祖父母疼惜你，多好！像我都沒\n   有，真羨慕你。', 'img': ''},
                'C': {'text': '(C)你覺得很難過，因為新媽媽不希望\n   別人知道你跟爸爸的關係。', 'img': ''},
                'D': {'text': '(D)新媽媽有自卑心理，無法面對自己\n   的選擇，你應該要同理她。', 'img': ''}
            },
            "isImage": ""
        },
        10: {
            'Q': {
                'text': '期中考快到了，爸爸和小新討論出一些方法來幫助他學習，下列何者不屬於後設認知策略？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)檢討學習方法是否有效', 'img': ''},
                'B': {'text': '(B)檢討考題，調整複習方式', 'img': ''},
                'C': {'text': '(C)整理歸納老師上課的重點', 'img': ''},
                'D': {'text': '(D)針對各科性質規劃讀書時間與策略 ', 'img': ''}
            },
            "isImage": ""
        },
        11: {
            'Q': {
                'text': '學生進行整數的乘除運算，完成「每邊長 60 公分的正方形瓷磚，每塊售價 14.4 元，若要以此瓷磚鋪滿一間長 3.6 公尺、寬 2.7 公尺的長方形房間，需要花多少錢？解這道題目時要用到「乘、除法的運算」，此種運算屬於哪一類知識？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)惰性知識\n   (inertial knowledge)', 'img': ''},
                'B': {'text': '(B)程序性知識\n   (procedural knowledge)', 'img': ''},
                'C': {'text': '(C)陳述性知識\n   (declarative knowledge)', 'img': ''},
                'D': {'text': '(D)條件性知識\n   (conditional knowledge)', 'img': ''}
            },
            "isImage": ""
        },
        12: {
            'Q': {'text': '蘇老師教英文時，經常使用具有諧音的中文字來幫助學生記憶英文單字。例如，先告訴學生「bounce」的諧音是「棒死」，再告訴學生「球會『彈起來』，真是『棒死了』！」這是哪一種記憶策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)位置法', 'img': ''},
                'B': {'text': '(B)串節法', 'img': ''},
                'C': {'text': '(C)假借字法', 'img': ''},
                'D': {'text': '(D)關鍵字法', 'img': ''}
            },
            "isImage": ""
        },
        13: {
            'Q': {'text': '新聞報導一名柬埔寨小男童能用多國語言向遊客兜售紀念品。小男童的行為表現較 符合史坦伯格(R. Sternberg)智力三元論的哪一種智能類型？', 'img': ''},
            'Option': {
                'A': {'text': '(A)實用智能\n   (practical intelligence)', 'img': ''},
                'B': {'text': '(B)創造智能\n   (creative intelligence)', 'img': ''},
                'C': {'text': '(C)分析智能\n   (analytical intelligence)', 'img': ''},
                'D': {'text': '(D)經驗智能\n   (experiential intelligence)', 'img': ''}
            },
            "isImage": ""
        },
        14: {
            'Q': {'text': '關於「鼓勵」(encourage)與「讚賞」(praise)的運用，下列何者正確？\n甲、鼓勵通常只能用在兒童表現不佳的時候\n乙、讚賞是一種隨時隨地可以運用的方法\n丙、鼓勵著重兒童努力的過程而不論其表現\n丁、讚賞是一種有條件式接納兒童的作為\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丁', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)丙丁', 'img': ''}
            },
            "isImage": ""
        },
        15: {
            'Q': {
                'text': '皮亞傑(J. Piaget)與維高思基(L. S. Vygotsky)對於兒童「自言自語」的行為，提出了不同的觀點，下列敘述何者錯誤？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)皮亞傑認為這是兒童自我中心的一\n   種表現', 'img': ''},
                'B': {'text': '(B)維高思基認為內在對話能力是高層\n   次認知歷程的發展特徵', 'img': ''},
                'C': {'text': '(C)皮亞傑認為兒童自言自語的行為反\n   映兒童認知發展尚未成熟', 'img': ''},
                'D': {'text': '(D)維高思基認為當工作變得比較難時\n   ，兒童自言自語的表現會減少', 'img': ''}
            },
            "isImage": ""
        },
        16: {
            'Q': {'text': '課堂活動的銜接或轉換(transition)如果沒有妥善控制，可能會浪費時間，並容易出現 學生失序的行為。下列哪一種作法較難順暢地進行課堂活動轉換？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)給予學生語文提示，要求學生重述\n   後再轉換', 'img': ''},
                'B': {'text': '(B)建立課堂活動慣例，讓學生熟悉活\n   動轉換流程', 'img': ''},
                'C': {'text': '(C)控制轉換時間，在活動時間結束時\n   就立刻轉換', 'img': ''},
                'D': {'text': '(D)以非語文信號集中學生注意力，說\n   明活動轉換流程', 'img': ''}
            },
            "isImage": ""
        },
        17: {
            'Q': {'text': '下列哪一個敘述較符合能力實存觀(entity view of ability)的概念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)小玲在接受體操訓練時總是滿頭大\n   汗，覺得自己的實力越來越強', 'img': ''},
                'B': {'text': '(B)小平看到發回來的考卷，說：\n   「我怎麼那麼笨，被題目給騙了。」', 'img': ''},
                'C': {'text': '(C)小威：「我的記憶力遺傳到我爸，\n   要考好英文對我而言是困難的。」', 'img': ''},
                'D': {'text': '(D)小安雖未獲選為籃球校隊，但他仍\n   每天針對弱點苦練，積極準備明年\n   的校隊甄選', 'img': ''}
            },
            "isImage": ""
        },
        18: {
            'Q': {'text': '李老師想要以滿足學生「自主需求」(need of autonomy)來提升學習動機。下列哪些作法較適合李老師採用？甲、提供學生選擇的機會\n乙、訂定明確的班級規範\n丙、讓學生為自己的學習選擇承擔後果\n丁、強調學業成就對未來生活的重要性\n', 'img': ''},
            'Option': {
                'A': {'text': '(A)甲乙', 'img': ''},
                'B': {'text': '(B)甲丙', 'img': ''},
                'C': {'text': '(C)乙丙', 'img': ''},
                'D': {'text': '(D)乙丁', 'img': ''}
            },
            "isImage": ""
        },
        19: {
            'Q': {'text': '小雅希望班上同學都喜歡、讚美她，然而她在班上卻有人際關係的困擾。陳老師試著引導她思考：「在學校裡有沒有一些特別的情況，是妳可以跟同學和諧相處的？那時候妳是怎麼辦到的？」老師採用的是哪一個學派的諮商輔導策略？', 'img': ''},
            'Option': {
                'A': {'text': '(A)溝通分析治療學派', 'img': ''},
                'B': {'text': '(B)個人中心治療學派', 'img': ''},
                'C': {'text': '(C)理性情緒治療學派', 'img': ''},
                'D': {'text': '(D)後現代治療學派', 'img': ''}
            },
            "isImage": ""
        },
        20: {
            'Q': {
                'text': '下列哪位兒童的認知發展最有可能已經進入形式運思期？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)小忠能夠控制變因，找出影響鐘擺\n   速度的因素', 'img': ''},
                'B': {'text': '(B)小美將鉛筆盒中的筆按照長短排列\n   ，並加以分類 ', 'img': ''},
                'C': {'text': '(C)小花能理解毛毛蟲轉變成蛹再轉變\n   成蝴蝶的歷程', 'img': ''},
                'D': {'text': '(D)小明知道液體從 A 杯倒入B杯，\n   體積仍不會改變', 'img': ''}
            },
            "isImage": ""
        },
        21: {
            'Q': {'text': '小學五年級的小和來自新移民家庭，平常就能夠很自然的使用國語以及越南語溝通。相較於只習慣使用國語溝通的同學，小和在下列哪一項能力的發展較為有利？', 'img': ''},
            'Option': {
                'A': {'text': '(A)執行功能', 'img': ''},
                'B': {'text': '(B)情緒覺察', 'img': ''},
                'C': {'text': '(C)圖形辨識', 'img': ''},
                'D': {'text': '(D)知覺廣度', 'img': ''}
            },
            "isImage": ""
        },
        22: {
            'Q': {
                'text': '教師資格考試結束後，幾位考生收到成績時分別有下列的反應：\n志明說：「今年題目特別難，我才會不及格。」\n春嬌說：「考試當天我身體不舒服，才會考這麼差！」\n國強說：「我用紫微斗數算過，知道自己今年考運很讚！」\n芳瑜說：「我本來就真的很不會考試啊！」\n根據溫納(B. Weiner)的歸因理論，下列何者正確？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)志明使用外在、可控制的歸因', 'img': ''},
                'B': {'text': '(B)春嬌使用內在、不穩定的歸因 ', 'img': ''},
                'C': {'text': '(C)國強使用外在、穩定的歸因 ', 'img': ''},
                'D': {'text': '(D)芳瑜使用內在、可控制的歸因', 'img': ''}
            },
            "isImage": ""
        },
        23: {
            'Q': {
                'text': '張老師向全班說明接下來的時間要同學各自做習作練習題，他注意到小方傳一張便利貼給小潔。張老師一邊繼續說明一邊走向小潔，不動聲色地拿走便利貼。此屬於下列    何種班級經營技巧的應用？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)全面掌控\n   (withitness)', 'img': ''},
                'B': {'text': '(B)團體聚焦\n   (group focus)', 'img': ''},
                'C': {'text': '(C)同時進行多項活動\n   (overlapping)', 'img': ''},
                'D': {'text': '(D)動作管理\n   (movement management)', 'img': ''}
            },
            "isImage": ""
        },
        24: {
            'Q': {'text': '全班同學跑完操場十圈之後，體育老師對著又餓又累急於下課的同學說：「你們什麼時候把體育用品整理好，就什麼時候下課。」老師運用的是下列何種機制？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)消弱', 'img': ''},
                'B': {'text': '(B)負增強', 'img': ''},
                'C': {'text': '(C)剝奪式懲罰', 'img': ''},
                'D': {'text': '(D)施予式懲罰', 'img': ''}
            },
            "isImage": ""
        },
        25: {
            'Q': {'text': '陳老師是國小一年級的導師。有一天，班上小朋友非常吵鬧，陳老師很生氣地說：「你們的聲音快把屋頂掀掉了！」小朋友看著屋頂滿臉疑惑的說：「屋頂好好的啊！」針對小朋友的反應，下列解釋何者較為正確？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)學生對陳老師這麼說很不高興，所以\n   故意說那些話氣陳老師', 'img': ''},
                'B': {'text': '(B)這班學生可能在語言上有發展遲緩的\n   現象，才會聽不懂陳老師的話', 'img': ''},
                'C': {'text': '(C)當時班上實在太吵了，學生沒有注意\n   陳老師說什麼，所以聽不懂老師的話', 'img': ''},
                'D': {'text': '(D)理解比喻和反諷語的發展年齡較晚，\n   小一學生聽不懂陳老師的話是正常的', 'img': ''}
            },
            "isImage": ""
        }
    }

    return question


def year110():
    pass


def year109():
    pass


def year108_2():
    pass


def year108_1():
    pass


def year106():
    pass


def year105():
    pass


def year104():
    pass


def year103():
    pass


def year102():
    pass


def year101():
    pass


def year100():
    pass


def year99():
    pass


def year98():
    pass


def year97():
    pass


def year96():
    pass


def year95():
    pass


def year94():
    pass


# print(create_template(25))
YEARS = [
    year112(), year111(), year110(), year109(), year108_2(),
    year108_1(), year106(), year105(), year104(), year103(),
    year102(), year101(), year100(), year99(), year98(),
    year97(), year96(), year95(), year94()
]
