def create_template(count):
    d = dict()
    for i in range(1, count + 1):
        d[i] = {
            "Q": {
                "text": "", "img": ""
            },
            "Option": {
                "A": {"text": "", "img": ""},
                "B": {"text": "", "img": ""},
                "C": {"text": "", "img": ""},
                "D": {"text": "", "img": ""}
            },
            "isImage": ""
        }

    return d


def year112():
    question = {
        1: {
            'Q': {'text': '詐騙集團以精心編製的 SOP 手冊教導新成員詐騙技巧，成效卓著。根據以上描述，這樣的教學活動明顯牴觸哪一項教育的規準？', 'img': ''},
            'Option': {
                'A': {'text': '(A)合認知性', 'img': ''},
                'B': {'text': '(B)合價值性', 'img': ''},
                'C': {'text': '(C)合自願性', 'img': ''},
                'D': {'text': '(D)合意向性', 'img': ''}
            },
            'isImage': ''
        },
        2: {
            'Q': {'text': '假新聞經由社會知名人士傳述時，易使民眾不假思索的接受與散播，此現象凸顯媒體識讀教育的重要。這種「訴諸人身」、「因人而信」的傾向，顯示人在認知上容易受到哪一種力量的影響？', 'img': ''},
            'Option': {
                'A': {'text': '(A)權威', 'img': ''},
                'B': {'text': '(B)理性', 'img': ''},
                'C': {'text': '(C)感官', 'img': ''},
                'D': {'text': '(D)天啟', 'img': ''}
            },
            'isImage': ''
        },
        3: {
            'Q': {'text': '下列敘述何者不符合弗雷勒(P.Freire)對話式教學的意涵？', 'img': ''},
            'Option': {
                'A': {'text': '(A)學生可以同時是教學者，教師可以同\n   時是學習者', 'img': ''},
                'B': {'text': '(B)對話式教學的目的之一，在於保持教\n   學價值中立', 'img': ''},
                'C': {'text': '(C)師生間採取非宰制的對待他人，以溝\n   通代替對立', 'img': ''},
                'D': {'text': '(D)教師避免囤積式的教學，以啟發學生\n   的批判能力', 'img': ''}
            },
            'isImage': ''
        },
        4: {
            'Q': {'text': '小華最近沈迷於手機遊戲，熬夜的結果導致每天賴床，家長必須三催四請，才不甘願的到校上課。家長無奈之餘，只好向導師請益。正巧小華的導師推崇盧梭(J.-J.Rousseau)的教育主張，導師比較可能對家長提出哪一項建議？', 'img': ''},
            'Option': {
                'A': {'text': '(A)幫小華報名多種才藝課，轉移小華對\n   手機遊戲的興趣', 'img': ''},
                'B': {'text': '(B)沒收小華的手機，直到小華戒掉熬夜\n   玩手機遊戲為止', 'img': ''},
                'C': {'text': '(C)與小華約法三章，明訂每天讀書及玩\n   手機遊戲的時間', 'img': ''},
                'D': {'text': '(D)不再叫小華起床，讓小華上學遲到，\n   受到應有的懲罰', 'img': ''}
            },
            'isImage': ''
        },
        5: {
            'Q': {'text': '為了讓學生了解紅樹林的生態與生長環境，王老師帶領學生前往嘉義縣鰲鼓溼地進行觀察與體驗。王老師的教學規劃最接近下列哪一種教育理念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)理性主義', 'img': ''},
                'B': {'text': '(B)自由主義', 'img': ''},
                'C': {'text': '(C)經驗主義', 'img': ''},
                'D': {'text': '(D)觀念主義', 'img': ''}
            },
            'isImage': ''
        },
        6: {
            'Q': {'text': '《漢娜．鄂蘭：思想的行動》紀錄片中的「平庸之惡(The Banality of Evil)」意指人們面對不公義的狀況時，缺乏獨立思考及批判能力而任人擺布。李老師深受啟發，開始關注教育現場各項措施的合理性，並提出建言。下列教育現場的現象，何者最符合鄂蘭所述的「平庸之惡」？', 'img': ''},
            'Option': {
                'A': {'text': '(A)陽奉陰違的應付', 'img': ''},
                'B': {'text': '(B)盲目的順從體制', 'img': ''},
                'C': {'text': '(C)不經思索的反對', 'img': ''},
                'D': {'text': '(D)違法的濫用處罰', 'img': ''}
            },
            'isImage': ''
        },
        7: {
            'Q': {'text': '稻米學校以「節氣」為核心，發展跨領域課程，例如：「驚蟄」時節，讓學生學習此時令之大氣變化、動植物生長、當季飲食、合乎時節的作息與文化活動。該課程最符合下列哪一種哲學理念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)道法自然', 'img': ''},
                'B': {'text': '(B)道德法則', 'img': ''},
                'C': {'text': '(C)兼愛非攻', 'img': ''},
                'D': {'text': '(D)理想世界', 'img': ''}
            },
            'isImage': ''
        },
        8: {
            'Q': {'text': '張老師利用日本動畫《進擊的巨人》中阿爾敏的臺詞：「堅信待在城牆內就能永遠安心的想法是有問題的，就算城牆 100 年來都沒有被摧毀，也無法保證未來不會被摧毀。」引導學生討論經驗與知識之關聯。上述臺詞反映的知識觀，與下列哪一位學者的理論最相關？', 'img': ''},
            'Option': {
                'A': {'text': '(A)培根(F.Bacon)—\n   知識即力量', 'img': ''},
                'B': {'text': '(B)傅柯(M.Foucault)—\n   知識即權力', 'img': ''},
                'C': {'text': '(C)波普(K.Popper)—\n   知識的可否證性', 'img': ''},
                'D': {'text': '(D)李歐塔(J.-F.Lyotard)—\n   知識的操作性', 'img': ''}
            },
            'isImage': ''
        },
        9: {
            'Q': {'text': '在網路化時代，人們可以隨時透過各種網路平台學習知識技能、交換資訊及結識學習夥伴。這樣的情形較接近下列哪一部教育著作的主張？', 'img': ''},
            'Option': {
                'A': {'text': '(A)伊利希(I. Illich)的\n   《非學校化社會》', 'img': ''},
                'B': {'text': '(B)格拉塞(W.Glasser)的\n   《沒有失敗的學校》', 'img': ''},
                'C': {'text': '(C)康茲(G.S.Counts)的\n   《學校敢勇於建立新的社會秩序嗎？》', 'img': ''},
                'D': {'text': '(D)赫西(E.D. Hirsch)的《我們所需要的\n   學校以及為何我們沒有這些學校》', 'img': ''}
            },
            'isImage': ''
        },
        10: {
            'Q': {'text': '某校的「學生法庭」是具有民主教育意義的「教育庭」，由學生自己擔任法庭成員，處理校內學生的爭執事件，讓學生學習自主、負責、權利、義務、對話與溝通。學生法庭的設立，最符合下列哪一位思想家的哲學觀點？', 'img': ''},
            'Option': {
                'A': {'text': '(A)柏拉圖(Plato)', 'img': ''},
                'B': {'text': '(B)尼爾(A.Neill)', 'img': ''},
                'C': {'text': '(C)布魯姆(B.Bloom)', 'img': ''},
                'D': {'text': '(D)笛卡兒(R.Descartes)', 'img': ''}
            },
            'isImage': ''
        },
        11: {
            'Q': {'text': '教師的言行易對學生發揮潛在的影響力，教師不僅需要肩負德育職責，且自身需要敦品，這種主張著眼於教師的哪一種權威？', 'img': ''},
            'Option': {
                'A': {'text': '(A)行政法理權威', 'img': ''},
                'B': {'text': '(B)學術認知權威', 'img': ''},
                'C': {'text': '(C)傳統習俗權威', 'img': ''},
                'D': {'text': '(D)道德涵養權威', 'img': ''}
            },
            'isImage': ''
        },
        12: {
            'Q': {'text': '教師面對新課綱跨領域的課程設計不免有些疑慮，例如：陳老師認為各學科有不同的知識系統，安排跨領域的課程，勢必會縮減學科內容的授課時間，降低學生的學習成效。陳老師的觀點屬於伯恩斯坦(B.Bernstein)課程論述中哪一種分類與架構？', 'img': ''},
            'Option': {
                'A': {'text': '(A)強分類強架構', 'img': ''},
                'B': {'text': '(B)強分類弱架構', 'img': ''},
                'C': {'text': '(C)弱分類強架構', 'img': ''},
                'D': {'text': '(D)弱分類弱架構', 'img': ''}
            },
            'isImage': ''
        },
        13: {
            'Q': {'text': '原生家庭為勞工階級的孫老師，以自己就是靠讀書向上流動而成為中產階級為例，在課堂中帶領學生了解社會階級與教育的關係。孫老師的信念較符合下列哪一個理論？', 'img': ''},
            'Option': {
                'A': {'text': '(A)階級衝突論', 'img': ''},
                'B': {'text': '(B)結構功能論', 'img': ''},
                'C': {'text': '(C)符號互動論', 'img': ''},
                'D': {'text': '(D)社會重建論', 'img': ''}
            },
            'isImage': ''
        },
        14: {
            'Q': {'text': '小恩時常跟著父母一同到國家音樂廳參加音樂會，或到美術館觀賞畫作，而他最擅長的才藝就是鋼琴演奏及繪畫，還經常代表學校參加各項音樂或繪畫比賽。小恩累積的經驗最符合下列哪一種資本？', 'img': ''},
            'Option': {
                'A': {'text': '(A)經濟資本', 'img': ''},
                'B': {'text': '(B)象徵資本', 'img': ''},
                'C': {'text': '(C)人力資本', 'img': ''},
                'D': {'text': '(D)文化資本', 'img': ''}
            },
            'isImage': ''
        },
        15: {
            'Q': {'text': '王老師是新進教師，校長要求結合她的資訊專長與校長自身的課程領導經驗，帶動全校跨領域的教學風氣，但王老師希望能先專心於班級教學。她的處境可以用下列哪一種概念說明？', 'img': ''},
            'Option': {
                'A': {'text': '(A)角色距離', 'img': ''},
                'B': {'text': '(B)角色衝突', 'img': ''},
                'C': {'text': '(C)角色模糊', 'img': ''},
                'D': {'text': '(D)角色擴散', 'img': ''}
            },
            'isImage': ''
        },
        16: {
            'Q': {'text': '依據《新住民就讀大學辦法》之規定，新住民申請大學入學，各校招生名額採外加百分之二計算。此做法屬於下列哪一種教育概念的實踐？', 'img': ''},
            'Option': {
                'A': {'text': '(A)文化再製', 'img': ''},
                'B': {'text': '(B)文化同化', 'img': ''},
                'C': {'text': '(C)積極性差別待遇', 'img': ''},
                'D': {'text': '(D)補救性教育措施', 'img': ''}
            },
            'isImage': ''
        },
        17: {
            'Q': {'text': '某校學務主任閱讀青少年次文化著作，書中提及勞工階級家庭背景學生的反學校文化，包括崇尚陽剛、輕蔑學術知識與文憑等。該著作最接近哪一位學者的觀點？', 'img': ''},
            'Option': {
                'A': {'text': '(A)艾波(M. Apple)', 'img': ''},
                'B': {'text': '(B)布迪爾(P.Bourdieu)', 'img': ''},
                'C': {'text': '(C)傅柯(M.Foucault)', 'img': ''},
                'D': {'text': '(D)衛里斯(P.Willis)', 'img': ''}
            },
            'isImage': ''
        },
        18: {
            'Q': {'text': '《高級中等學校訂定學生服裝儀容規定之原則》提及，學生的服裝儀容於重要活動應遵守學校統一規定，學校對於違反規定者，得視情節，採取適當且合乎比例原則之輔導或管教措施，並不得加以處罰。實際上，為達班級凝聚之目的，同儕會相互約束統一服儀。上述情境最符合涂爾幹(E.Durkheim)的哪一個理論觀點？', 'img': ''},
            'Option': {
                'A': {'text': '(A)道德規範', 'img': ''},
                'B': {'text': '(B)社會正義', 'img': ''},
                'C': {'text': '(C)權力展演', 'img': ''},
                'D': {'text': '(D)社會認同', 'img': ''}
            },
            'isImage': ''
        },
        19: {
            'Q': {'text': '趙老師認為不是每個人都足以擔任學校或幼兒園的領導者，領導者要能掌控自己的情緒、充滿自信、正直、具備責任感。上述看法較接近下列哪一種領導理論？', 'img': ''},
            'Option': {
                'A': {'text': '(A)行為論', 'img': ''},
                'B': {'text': '(B)權變論', 'img': ''},
                'C': {'text': '(C)情境論', 'img': ''},
                'D': {'text': '(D)特質論', 'img': ''}
            },
            'isImage': ''
        },
        20: {
            'Q': {'text': '某天聽覺障礙的女學生向導師反映，在下課時間，隔壁班的男生經過她身邊時藉機摸她的胸部，讓她感覺非常不舒服。導師立即告知學務處，學校也依規定在 24 小時內向主管機關通報。此乃依循下列哪一種法規進行通報？', 'img': ''},
            'Option': {
                'A': {'text': '(A)性騷擾防治法', 'img': ''},
                'B': {'text': '(B)特殊教育法', 'img': ''},
                'C': {'text': '(C)學生輔導法', 'img': ''},
                'D': {'text': '(D)性別平等教育法', 'img': ''}
            },
            'isImage': ''
        },
        21: {
            'Q': {'text': '依照現行《師資培育法》第 3 條規定，師資生應於參加教師資格考試前，修畢師資職前教育課程，下列哪一種課程未明訂於該法規中？', 'img': ''},
            'Option': {
                'A': {'text': '(A)校訂課程', 'img': ''},
                'B': {'text': '(B)普通課程', 'img': ''},
                'C': {'text': '(C)專門課程', 'img': ''},
                'D': {'text': '(D)教育專業課程', 'img': ''}
            },
            'isImage': ''
        },
        22: {
            'Q': {'text': '某縣(市)政府委託本國自然人，將該縣(市)內偏遠地區公立學校轉型為公辦民營實驗教育學校。上述情形是依據下列哪一種法規辦理？', 'img': ''},
            'Option': {
                'A': {'text': '(A)學校型態實驗教育實施條例', 'img': ''},
                'B': {'text': '(B)偏遠地區學校教育發展條例', 'img': ''},
                'C': {'text': '(C)公立高級中等以下學校委託私人辦理\n   實驗教育條例', 'img': ''},
                'D': {'text': '(D)高級中等以下教育階段非學校型態實\n   驗教育實施條例', 'img': ''}
            },
            'isImage': ''
        },
        23: {
            'Q': {'text': '教育行政的理論模式區分為理性系統、自然系統、開放系統、非均衡系統，下列哪一種理論屬於自然系統模式？', 'img': ''},
            'Option': {
                'A': {'text': '(A)權變理論\n   (contingency theory)', 'img': ''},
                'B': {'text': '(B)科層理論\n   (theory of bureaucracy)', 'img': ''},
                'C': {'text': '(C)人際關係理論\n   (human relations theory)', 'img': ''},
                'D': {'text': '(D)科學管理理論\n   (theory of scientific management)', 'img': ''}
            },
            'isImage': ''
        },
        24: {
            'Q': {'text': '某日學生在教室爭吵打架，導師馬上積極介入且認為已妥善處理，豈料班上的學生紛紛轉學，隨之，社會輿論沸騰，嚴重影響學校聲譽。此一現象最符合混沌理論的哪一種特性？', 'img': ''},
            'Option': {
                'A': {'text': '(A)蝴蝶效應(butterfly effect)', 'img': ''},
                'B': {'text': '(B)奇特吸引子(strange attractor)', 'img': ''},
                'C': {'text': '(C)耗散結構(dissipative structure)', 'img': ''},
                'D': {'text': '(D)回饋機制(feedback mechanism)', 'img': ''}
            },
            'isImage': ''
        },
        25: {
            'Q': {'text': '孫老師認為教師工作深具價值與意義，能夠發揮教育專業，陪伴學生一同成長，與同事、家長和學生維持良好的互動關係，積極投入教學工作，並獲得成就感。他遭遇挫折時，能正向思考，樂觀面對挑戰。孫老師的情形最符合下列哪一種概念？', 'img': ''},
            'Option': {
                'A': {'text': '(A)自我效能\n   (self-efficacy)', 'img': ''},
                'B': {'text': '(B)學術樂觀\n   (academic optimism)', 'img': ''},
                'C': {'text': '(C)幸福感\n   (psychological well-being)', 'img': ''},
                'D': {'text': '(D)組織承諾\n   (organizational commitment)', 'img': ''}
            },
            'isImage': ''
        }
    }

    return question


def year111():
    question = {
        1: {
            'Q': {'text': '「不要讓你的孩子輸在起跑點！」這句話依據謝富樂(I. Scheffler)的主張，屬於下列哪一種教育語言？ ', 'img': ''},
            'Option': {
                'A': {'text': '(A)教育的定義', 'img': ''},
                'B': {'text': '(B)教育的明喻', 'img': ''},
                'C': {'text': '(C)教育的隱喻', 'img': ''},
                'D': {'text': '(D)教育的口號', 'img': ''}
            },
            'isImage': ''
        },
        2: {
            'Q': {'text': '某雜誌有一期的標題為：「品格致富」。這種主張較為接近下列哪一派道德哲學觀點？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)效益論\n   (Utilitarianism)', 'img': ''},
                'B': {'text': '(B)理性論\n   (Rationalism)', 'img': ''},
                'C': {'text': '(C)義務論\n   (Deontological Ethics)', 'img': ''},
                'D': {'text': '(D)關懷論\n   (Ethics of Care) ', 'img': ''}
            },
            'isImage': ''
        },
        3: {
            'Q': {'text': '中國《禮記．曲禮》中，所謂的「禮聞來學，不聞往教」之精神，最接近皮德思(R. S. Peters)所提出的何種「教育規準」？ ', 'img': ''},
            'Option': {
                'A': {'text': '(A)合實用性\n   (Practicality)', 'img': ''},
                'B': {'text': '(B)合認知性\n   (Cognitiveness)', 'img': ''},
                'C': {'text': '(C)合價值性\n   (Worth whileness)', 'img': ''},
                'D': {'text': '(D)合自願性\n   (Voluntariness) ', 'img': ''}
            },
            'isImage': ''
        },
        4: {
            'Q': {
                'text': '智睿從學校抱一堆書回家，裡面有《理想國》、《論語》等。家人好奇的問他，他說：「老師跟我們說明這學期的課程設計，是請我們大量閱讀這些古典著作。他認為透過閱讀這些鉅著(The Great Books)，可以建立最有價值的觀念。」這位老師所持有的理念較接近下列哪一種教育哲學取向？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)經驗主義\n   (Empiricism)', 'img': ''},
                'B': {'text': '(B)實用主義\n   (Pragmatism)   ', 'img': ''},
                'C': {'text': '(C)永恆主義\n   (Perennialism) ', 'img': ''},
                'D': {'text': '(D)重建主義\n   (Reconstructionism) ', 'img': ''}
            },
            'isImage': ''
        },
        5: {
            'Q': {'text': '遊戲在教學活動中的作用，下列哪一敘述有誤？ ', 'img': ''},
            'Option': {
                'A': {'text': '(A)遊戲可發揮學生想像力', 'img': ''},
                'B': {'text': '(B)遊戲可使學生不受預設目的之侷限', 'img': ''},
                'C': {'text': '(C)遊戲的主要目的在於競賽與爭取勝利', 'img': ''},
                'D': {'text': '(D)遊戲可以創造美感經驗，豐富學習\n   內涵', 'img': ''}
            },
            'isImage': ''
        },
        6: {
            'Q': {
                'text': '劉老師是一位「實用主義」(Pragmatism)的實踐者，向來認為「實用主義」的方法有助於提升學生的學習成效。下列哪一項是劉老師認為最重要的學習活動？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)針對複雜概念進行細緻分析', 'img': ''},
                'B': {'text': '(B)針對意識型態進行嚴密批判 ', 'img': ''},
                'C': {'text': '(C)針對長期需求進行美感設計', 'img': ''},
                'D': {'text': '(D)針對生活問題進行縝密探究', 'img': ''}
            },
            'isImage': ''
        },
        7: {
            'Q': {'text': '「平面三角形內角和等於兩直角的和」，這個命題是屬於下列哪一種性質的知識？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)經驗的', 'img': ''},
                'B': {'text': '(B)先驗的', 'img': ''},
                'C': {'text': '(C)超驗的', 'img': ''},
                'D': {'text': '(D)體驗的', 'img': ''}
            },
            'isImage': ''
        },
        8: {
            'Q': {
                'text': '李老師認為「把最重要、最基本的知識教給學生，不必要浪費時間從嘗試錯誤中學習。」李老師的觀點較接近下列哪一種教育哲學理論？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)精粹主義\n   (Essentialism)', 'img': ''},
                'B': {'text': '(B)進步主義\n   (Progressivism)', 'img': ''},
                'C': {'text': '(C)重建主義\n   (Reconstructionism)', 'img': ''},
                'D': {'text': '(D)存在主義\n   (Existentialism) ', 'img': ''}
            },
            'isImage': ''
        },
        9: {
            'Q': {'text': '學校組織變革過程中，下列哪一項是教師增能賦權(empowerment)受到重視的主因？', 'img': ''},
            'Option': {
                'A': {'text': '(A)可強化教師形象，加速教師分級', 'img': ''},
                'B': {'text': '(B)可彰顯教師的權力，強化學校自籌\n   經費的能力', 'img': ''},
                'C': {'text': '(C)可強化教師之多元能力，較有機會\n   找到非教職的工作', 'img': ''},
                'D': {'text': '(D)可讓教師擁有更多專業自主權，參\n   與校務及教學的革新', 'img': ''}
            },
            'isImage': ''
        },
        10: {
            'Q': {
                'text': '「學校應用正向管教辦法輔導有霸凌行為的同學」，這種作法是運用何種懲罰原理？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)報復說\n   (Retributive Theory)', 'img': ''},
                'B': {'text': '(B)懲戒說\n   (Deterrent Theory)', 'img': ''},
                'C': {'text': '(C)感化說\n   (Reformative Theory)', 'img': ''},
                'D': {'text': '(D)人道說\n   (Humanist Theory) ', 'img': ''}
            },
            'isImage': ''
        },
        11: {
            'Q': {'text': '有關諾丁思(N. Noddings)關懷(care)倫理學的主張，下列敘述何者最正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)認為「關懷」是基於理性所生之道德\n   感', 'img': ''},
                'B': {'text': '(B)主張道德教育的重點是肯定、楷模、\n   實踐、對話', 'img': ''},
                'C': {'text': '(C)主張關懷關係是人與人之間和平相處\n   不得不然的行為', 'img': ''},
                'D': {'text': '(D)道德教育的方法主要為透過兩難故事\n   的論辯以澄清價值判斷 ', 'img': ''}
            },
            'isImage': ''
        },
        12: {
            'Q': {
                'text': '潘老師十分珍惜理解學生的契機，會試著放下對學生既有的印象，而以全新角度迎接學生。這樣的作法較接近下列哪一種教師理念？',
                'img': ''},
            'Option': {
                'A': {'text': '(A)教師即鑄劍者', 'img': ''},
                'B': {'text': '(B)教師即陌生人', 'img': ''},
                'C': {'text': '(C)教師即研究者', 'img': ''},
                'D': {'text': '(D)教師即轉化的知識份子', 'img': ''}
            },
            'isImage': ''
        },
        13: {
            'Q': {'text': '斯普朗格(E. Spranger)主張有六種人格類型，分別追求不同的價值，其中追求「愛」的價值者是下列哪一類型？', 'img': ''},
            'Option': {
                'A': {'text': '(A)社會型', 'img': ''},
                'B': {'text': '(B)宗教型', 'img': ''},
                'C': {'text': '(C)藝術型', 'img': ''},
                'D': {'text': '(D)理論型', 'img': ''}
            },
            'isImage': ''
        },
        14: {
            'Q': {'text': '下列哪一種論述較符合批判教育學(Critical Pedagogy)的觀點？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)族群意識不會影響課程與教學的預\n   期效果', 'img': ''},
                'B': {'text': '(B)教科書都經過嚴格審查，不會有文\n   化霸權的問題', 'img': ''},
                'C': {'text': '(C)教師應鼓勵學生質疑社會現象，幫\n   助學生形塑自我認同 ', 'img': ''},
                'D': {'text': '(D)課程與知識應該中立客觀，在教學\n   時應避免討論政治議題 ', 'img': ''}
            },
            'isImage': ''
        },
        15: {
            'Q': {'text': '學校的教學活動在於切合生產關係所需，符合資本主義社會的需求。此種看法較屬於下列哪一種觀點？',
                  'img': ''},
            'Option': {
                'A': {'text': '(A)文化傳承', 'img': ''},
                'B': {'text': '(B)文憑主義', 'img': ''},
                'C': {'text': '(C)符應理論', 'img': ''},
                'D': {'text': '(D)順從理論', 'img': ''}
            },
            'isImage': ''
        },
        16: {
            'Q': {'text': '張老師進行社會領域教學時，將學生分成小組進行社區探查，蒐集各種資料及各方觀點，探討社區產業、環保、人口和生活品質等方面發展的正、反意見，規劃未來道路闢建的構想，並向地方政府主管機關提出建議書。張老師的作法主要採取下列哪一種理論取向？', 'img': ''},
            'Option': {
                'A': {'text': '(A)社會效率論', 'img': ''},
                'B': {'text': '(B)社會重建論', 'img': ''},
                'C': {'text': '(C)社會功能論', 'img': ''},
                'D': {'text': '(D)社會和諧論', 'img': ''}
            },
            'isImage': ''
        },
        17: {
            'Q': {'text': '在學校中透過評量與獎懲，將學生的表現排定優劣，區分名次。結構功能論學者認為這種作法屬於下列哪一種功能？ ', 'img': ''},
            'Option': {
                'A': {'text': '(A)選擇', 'img': ''},
                'B': {'text': '(B)社會化', 'img': ''},
                'C': {'text': '(C)分配地位', 'img': ''},
                'D': {'text': '(D)建立學習標準', 'img': ''}
            },
            'isImage': ''
        },
        18: {
            'Q': {
                'text': '下列敘述何者較能闡述競爭性流動之意涵？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)注重學生社經背景的影響', 'img': ''},
                'B': {'text': '(B)能讓努力者得其英才地位', 'img': ''},
                'C': {'text': '(C)既有的英才及其代表者控制了英才\n   的選擇權', 'img': ''},
                'D': {'text': '(D)傳統世襲制度的社會是競爭性流動\n   社會的代表', 'img': ''}
            },
            'isImage': ''
        },
        19: {
            'Q': {'text': '學校利用大門口牆壁貼滿該校學生參加科展、畫展、球類比賽、國語文競賽等優異成績，作為與家長進行對話的素材，增進社區對學校的認知與好感。學校這種作法最符合下列哪一種理論之應用？', 'img': ''},
            'Option': {
                'A': {'text': '(A)交換理論', 'img': ''},
                'B': {'text': '(B)衝突理論', 'img': ''},
                'C': {'text': '(C)符號互動論', 'img': ''},
                'D': {'text': '(D)結構功能論', 'img': ''}
            },
            'isImage': ''
        },
        20: {
            'Q': {
                'text': '教育行政在討論資源分配時，會考量到公平原則，其中又區分為水平公平和垂直公平。下列哪一種教育作為屬於垂直公平？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)學校營養午餐的價格齊一化', 'img': ''},
                'B': {'text': '(B)學校的教科書內容和價格一致', 'img': ''},
                'C': {'text': '(C)學校規劃班級教室大小面積盡量一致', 'img': ''},
                'D': {'text': '(D)教師協助班上弱勢學生申請費用減免', 'img': ''}
            },
            'isImage': ''
        },
        21: {
            'Q': {'text': '學校教育變革的 R-D-D-A 模式分為「研究(Research)、發展(Development)、傳播(Diffusion)、採用(Adoption)」四個階段。某國教育部進行課程綱要的修訂，「利用多元管道說明課程綱要修訂的原因與經過」，這屬於 R-D-D-A模式的哪一個階段？ ', 'img': ''},
            'Option': {
                'A': {'text': '(A)研究', 'img': ''},
                'B': {'text': '(B)發展', 'img': ''},
                'C': {'text': '(C)傳播', 'img': ''},
                'D': {'text': '(D)採用', 'img': ''}
            },
            'isImage': ''
        },
        22: {
            'Q': {'text': '某校的決策過程大多是顧及不同立場教師之間的爭執，經利益折衝後做出決定。該校行政決策較屬於下列哪一種模式？', 'img': ''},
            'Option': {
                'A': {'text': '(A)政治模式\n   (Political Model)', 'img': ''},
                'B': {'text': '(B)直覺模式\n   (Intuitive Model)', 'img': ''},
                'C': {'text': '(C)垃圾桶模式\n   (Garbage Can Model)', 'img': ''},
                'D': {'text': '(D)漸進模式\n   (Incremental Model)', 'img': ''}
            },
            'isImage': ''
        },
        23: {
            'Q': {'text': '依據權變領導(contingency leadership)理論，學校領導者須視當時的情境而採取適當的行動。下列哪一因素不是費德勒(F. Fiedler)的情境考量因素？', 'img': ''},
            'Option': {
                'A': {'text': '(A)職務權力 ', 'img': ''},
                'B': {'text': '(B)工作結構', 'img': ''},
                'C': {'text': '(C)人際關係', 'img': ''},
                'D': {'text': '(D)道德規範', 'img': ''}
            },
            'isImage': ''
        },
        24: {
            'Q': {'text': '教育行政理論之演進，依年代先後的發展順序，下列何者正確？', 'img': ''},
            'Option': {
                'A': {'text': '(A)開放系統→非均衡系統→\n   理性系統→自然系統', 'img': ''},
                'B': {'text': '(B)自然系統→理性系統→\n   開放系統→非均衡系統 ', 'img': ''},
                'C': {'text': '(C)非均衡系統→自然系統→\n   開放系統→理性系統', 'img': ''},
                'D': {'text': '(D)理性系統→自然系統→\n   開放系統→非均衡系統 ', 'img': ''}
            },
            'isImage': ''
        },
        25: {
            'Q': {
                'text': '國民中小學學生修業期滿，成績及格，由學校發給畢業證書。出席率及獎懲部分，須達到學習期間授課總日數扣除學校核可之公、喪、病假，上課總出席率至少達到多少比率，且經獎懲抵銷後，未滿三大過，才符合現行《國民小學及國民中學學生成績評量準則》之規定？ ',
                'img': ''},
            'Option': {
                'A': {'text': '(A)二分之一以上', 'img': ''},
                'B': {'text': '(B)三分之二以上', 'img': ''},
                'C': {'text': '(C)四分之三以上', 'img': ''},
                'D': {'text': '(D)五分之三以上', 'img': ''}
            },
            'isImage': ''
        }
    }

    return question


def year110():
    pass


def year109():
    pass


def year108_2():
    pass


def year108_1():
    pass


def year106():
    pass


def year105():
    pass


def year104():
    pass


def year103():
    pass


def year102():
    pass


def year101():
    pass


def year100():
    pass


def year99():
    pass


def year98():
    pass


def year97():
    pass


def year96():
    pass


def year95():
    pass


def year94():
    pass


# print(create_template(25))
YEARS = [
    year112(), year111(), year110(), year109(), year108_2(),
    year108_1(), year106(), year105(), year104(), year103(),
    year102(), year101(), year100(), year99(), year98(),
    year97(), year96(), year95(), year94()
]